[
	{"text":"After waiting for almost 30 minutes to trade in an old phone part of the buy back program, our customer service rep incorrectly processed the transaction. This led to us waiting another 30 minutes for him to correct it. Don't visit this store if you want pleasant or good service.","label":0},
	{"text":"Wonderful reuben. Map shown on Yelp page is incorrect. It is actually a different Hawkins. I'd recommend a call for directions 412-271-9911.","label":1},
	{"text":"Awesome drink specials during happy hour. Fantastic wings that are crispy and delicious, wing night on Tuesday and Thursday!","label":1},
	{"text":"Very disappointed in the customer service. We ordered Reuben's  and wanted coleslaw instead of kraut. They charged us $3.00 for the coleslaw. We will not be back . The iced tea is also terrible tasting.","label":0},
	{"text":"Terrible. Preordered my tires and when I arrived they couldn't find the order anywhere. Once we got through that process I waited over 2 hours for them to be put on... I was originally told it would take 30 mins. Slow, over priced, I'll go elsewhere next time.","label":0},
	{"text":"Don't waste your time.  We had two different people come to our house to give us estimates for a deck (one of them the OWNER).  Both times, we never heard from them.  Not a call, not the estimate, nothing.","label":0},
	{"text":"Average run of the mill store.  Associates are young teens and they really don't know where anything is.  Luckily I am able to get around to find everything.  Found my puppy treats and moved on.","label":0},
	{"text":"If you are searching for a go to fish place for Lent....look no further.  This place will give you the best fish sandwich in Pittsburgh.  The sandwich has enough fish to make four sandwiches.  You will not be able to finish this sandwich in one seating.\\nEnjoy....","label":1},
	{"text":"Italian dinners, American, endless soup and salad bar is great. Most food for your dollar. I highly recommend. Great bar. Good place to watch a game. The bar can get quite noisy in the evenings, but it adds to the great atmosphere at Rocky's","label":1},
	{"text":"Good Luck getting a seat, that's all I have to say. The Gab and Eat is famous and infamous. Diner food is what's up and I like it. When I was a roofing mechanic, we'd meet there before work. Although I'm not sure I would recommend it if you're working were there's no bathrooms. hehe","label":1},
	{"text":"Cheap, unpretentious, and, for this, one of my favorite breakfast joints in the country.  Simply put I LOVE it here.  The mixed grill, the sausage and egg on a biscuit, the home fries.  This it the very definition of diner.  Thank you Gab 'n' Eat!","label":1},
	{"text":"Great little place. Treats you like a local.Eaten here 3 times a week for a month.  Same overtime. Barb is always here.","label":1},
	{"text":"Far away from real Chinese food. Doesn't even taste good as American style Chinese food.","label":0},
	{"text":"We went on a weeknight.  Place was not busy waited over 20 minutes for drinks and to have our order taken.  We ordered an app and it came out with the meals and that was another 20 minutes or so.  Food was luke warm at best.  I would not go back.","label":0},
	{"text":"Went for breakfast on 6/16/14. We received very good service and meal came within a few minutes.Waitress could have smiled more but was friendly. \\nI had a Grand Slam... it was more than enough food. \\nMeal was very tasty... We will definitely go back. \\nIt is a popular Denny's.","label":1},
	{"text":"If you like being greeted in the morning by a gym worker slopping down eggs from a frying pany instead of working....this is your gym....complain to the manager and she gets nasty....try getting in touch with the owner....impossible!  Most unprofessional gym ever!!!!","label":0},
	{"text":"Papa J's is by far my favorite restaurant in Pittsburgh, my hometown.  I eat there almost every time I visit, and everything I've ever ordered has been fantastic.  Fresh ingredients, simple preparation, reasonable prices.  Also, they make the best pizza in town HANDS DOWN.","label":1},
	{"text":"Terrible service.  Food unremarkable.  Waiter disappeared for 45 minutes to serve larger group due to staffing mismanagement.  Saved his tip by discounting meal after I complained.  All and all, a very crude and unpleasant dining experience for me and my guests.  Not to be repeated, never again!","label":0},
	{"text":"Yay, I'm a fan of the white pizza.  Had take out.  \\n\\nThe bar was jumping when I picked up our order.\\n\\nThe white pizza is so delicious...with garlic, spinach, feta, and added some veggies.  Tried the Roman Style calamari, very good better than the fried calamari we had last time.","label":1},
	{"text":"Great little gem! The food was fantastic was very food and just the right price. The Italian food was amazing, but you can not leave without a dessert and be prepared for giant serving. I had the carrot cake yummy!! Def a place everyone should try.","label":1},
	{"text":"Service in this place is poor because of lack of acknowledgment since people working there are \\\"\"just\\\"\" working . They have nice decor,nice bar and good bread. Consider where this place is ,the prices are really really high . Nothing is served on the side with main dishes ....","label":0},
	{"text":"Terrible service...terrible food...this place smells like rotten wet wood","label":0},
	{"text":"Papa J's is expensive and inconsistent.  The ambiance is nice but it doesn't justify the prices.  There are better restaurants in Carnegie.","label":0},
	{"text":"I've decided where I stand with Emmert Dental. They are unprofessional, rude and have no clue what they're doing (behind the desk). I will not be going back nor will I have nice things to say about them.","label":0},
	{"text":"The worst dental office I ever been. No one can beat it!!! You should avoid it at any time.","label":0},
	{"text":"If there was ever a \\\"\"get your coffee and go\\\"\" Starbucks, this is it. Right in the center of the Waterfront, this Starbucks has no sofa, comfy chairs, only table seating. I love the baristas here, But I don't like the location of the building.","label":0},
	{"text":"This Starbucks is teeny-tiny!\\n\\nSeating inside is VERY limited.  This is a Starbucks to grab and go and continue your shopping at the Waterfront.\\n\\nBaristas are friendly and fast.","label":0},
	{"text":"It's yet another Michael's, and it's a very good one. Recommended always. For those who love crafting, Michael's is a godsend.","label":1},
	{"text":"This place is s l o w....like so slow I have got up and left after waiting 30 minutes and not even being acknowledged by a server. The food is okay. Def not worth the wait. Milkshakes are just okay as well. Booooooo.","label":0},
	{"text":"Food is good, what you'd expect from Steak n Shake. THE SERVICE IS AWFUL. so incredibly awful. expect to take at least an hour for your meal, even when it's slow. I've been going here for years when I want a cheap meal, but the service is so so so awful. Go to McDonalds.","label":0},
	{"text":"I like the occasional steak and shake stop.....    but this one has to be the slowest one ever.    The cashier was rude and I could hear her yelling are you fucking kidding me because the register was not working the way she wanted....     wow.... just wow...","label":0},
	{"text":"Every time we come here the service is laughably bad. On this visit a tabe which was sat after us had their food before our server graced us with her surly presence. Good restaurant elsewhere, just avoid this location if you want to get your food inside an hour.","label":0},
	{"text":"Wow. Dirty and slow.  The floors felt like they had the days burger grease spilled all over, and it took 30 m8n to get our take out order.","label":0},
	{"text":"It's okay. Food is cheap but portions are small. For example I order the chicken tenders, and I got 3 little tiny tenders, and a decent amount of fries. Also the restaurant is not really clean either.  This restaurant is not my number 1 choice.","label":0},
	{"text":"Love this store!  Don't always have much luck with the sales, but I always find something I like here.  This isn't your average Marshall's or TJ Max.  I think the green dress I'm wearing is from Filene's!","label":1},
	{"text":"Another store which has gone the way of the Dodo bird. Actually there was nothing basement like about it. What will be done with the empty space that is the question?","label":0},
	{"text":"He was incredibly sexist/homophobic. He could barely play the piano and when we finally recognized a song we could actually dance to he literally asked me to get off stage because he didn't like another on stage who could actually dance with the girls.","label":0},
	{"text":"Waterfront Lowe's beats Monroeville Lowe's for lawn and garden.  Hate to admit it, but it's true.","label":1},
	{"text":"This place is overrated. A friend and I were looking forward to a beer and some good bar food- instead the wings were terrible and the beer was good but overpriced. There's nothing wrong with this place I just don't understand the clout around it. There should be no clout.","label":0},
	{"text":"This place just plain sucks\\nBad management lost them biz\\nDumb arcade drama*\\n\\n* they have recently changed their under 21 policy so no one underage can even be in the arcade or restaurant after 10pm despite having a guardian over 30 years old","label":0},
	{"text":"Most of the games were out of order and I had to find one of those referee looking people to fix 2 of them that took some of our credits.  Apathetic service staff all around, the Peanut and I were really disappointed.  Won't be back.","label":0},
	{"text":"Pretty good! Excellent beer sampler - bargain!  Veggie burger awesome. Onion rings awesome. Fried Mac n cheese was delicious - crunchy on the outside, creamy on the inside. Carrot cake was monstrously huge and delicious.","label":1},
	{"text":"Beer selection was good, but they were out of the ones we wanted. 4 of the 6 people in our group ordered steaks all of them were cooked to their satisfaction. The bourbanzola was a good addition. Defiantly a place I would go again. Joe, our server, was awesome and super friendly.","label":1},
	{"text":"I love this place!  Great atmosphere and friendly service every time I go!!","label":1},
	{"text":"For a brewery who is attempting to take advantage of Oktoberfest you wonder how at 7 pm they could be out of mashed potatoes & sauerkraut then a sausage platter with sweet mustard guess they have not been to Germany. Not worth $5.95 unfortunately the sausage platter was $15.95.","label":0},
	{"text":"First time I was here I had chicken quesadilla's and they were bad.  We went again last weekend. I had the chicken avacod sandwich.  It was very good.  No fat in the chicken.  Just a mess to eat, but still awesome.   Also had the chocolate stout cupcake, it was amazing.","label":1},
	{"text":"I'm a regular here since their kitchen is open late and it's a good option after movies. Their nachos is pretty good. I also tried their burger and chicken sandwiches and they're good as well. \\nI think the only thing I did't like is the steak taco appetizer. It was too sour and kinda tasteless.","label":1},
	{"text":"Be careful. The servers can't pay attention to save their lives, and the management cares even less. I want to make sure people know how careless the management is, particularly Mark who seems to let his staff run around.","label":0},
	{"text":"Wast there last Friday. Seats right in front if the stage. The show was good. The headliner, while a bit long, was good. Fantastic service from our waitresses. Will definitely go back.","label":1},
	{"text":"Fantastic food.\\n This place is mainly a \\\"\"bar\\\"\" and does get crowded but I really like the pizza here.  In fact I've never had a bad meal.  The staff are ussually very helpful but it does get a bit loud inside when crowded.","label":1},
	{"text":"The absolute worst service I have ever had at any bar or restaraunt.  And, in looking at other reviews, I am not the first.  There are many options at the Waterfront, and I would suggest you try any of them; but stay far away from this place!","label":0},
	{"text":"Servers are chatting, not paying attention to tables. I can see my salad is ready at the window. Worst serves ever.","label":0},
	{"text":"The food was okay. The noise level--with 10 people in a huge room--deafening. Awful acoustics!","label":0},
	{"text":"Food is Shitty probably would be good if they had a cook that knew how to cook it correctly.  Staff is ok no complaints drinks are good as well","label":0},
	{"text":"Really the only thing good about this place is the happy hour. No one wants to pay $8 for a glass of wine that is a short pour and bottom quality.","label":0},
	{"text":"It's fun, but not as fun as Kennywood. The boardwalk food is a bit too far from the wave pool and that makes for a lot of shoes on/shoes off events. The lazy river could be much better. I did like the water slides and the Potato Patch fries, as well as the scenic location.","label":0},
	{"text":"Dont waste your time with this place.  Long lines, overpriced and no shade or cooling spots while you wait. Half the \\\"\"rides\\\"\" were shut down. You're better off with a garden hose. Save your money or buddy up to someone with a pool.","label":0},
	{"text":"The worse \\\"\"Chinese food\\\"\", even the white rice which came with the ogle sweet and sour chicken is really bad.  Please don't eat this food.","label":0},
	{"text":"This place.. Is ok if ur grabn something quick .. But they do have a great happy hour tho","label":0},
	{"text":"Boo!  What happened to this location?  It used to be happy and fun!  It just feels depressing and nearly everyone there is just doing the bare minimum to get by?  So sad.","label":0},
	{"text":"I had a gift card so I decided to use it for a to go order. The food tasted frozen and microwaved. Nothing special just around average!","label":0},
	{"text":"Awful everything. From the bad service, to the diluted soup, to the lame-no chicken on the chicken salad, to the PRE-fabricated pizza. AVOID THIS PLACE!","label":0},
	{"text":"Food was ok had a steak w/ shrimp side Ass mashed potatoes. Everything was ok not a lot of flavor.","label":0},
	{"text":"Pizza ok on it's own nothing great . Definitely not worth the restaurant price.  definitely not like pizzeria UNO in Chicago. Are they even related   or are they just using their name and trademark.","label":0},
	{"text":"The menu is outstanding but the pizza and beer is too expensive. For 2 personal pizzas (the size of pizza hut) 2 beers and 2 salads, we paid over $50 bucks. The personal pizzas alone were $11 each... If you want pizza and beer go somewhere else-pasta appetizers, or sandwiches... this place is good.","label":0},
	{"text":"Wham! 4 stars outta the park! The deep-dish pizza we had was amazing. I wasn't crazy about the avocado egg rolls, but the chocolate chip sundae was superb. Great service too from Maranda, a doll. Decor is cute. Ambience is lively. Recommended.","label":1},
	{"text":"Was very disappointed with the food. It was overcooked and not seasoned very well","label":0},
	{"text":"Nice place but some of the items on the menu are not available unless you get a 2 for 12 but that's not what the online menu states. And it's a salad come on..","label":0},
	{"text":"I hate this place.\\nIt's very loud, the service is very poor, and the food is so-so.\\nIf you want good Chinese in Pittsburgh, try China Palace (Shadyside) or Sesame Inn (Station Square or North Hills).  They're quieter, with very good food & service.","label":0},
	{"text":"Rude unwelcoming short haired black hostess. Drinks were not good. Greasy spring  rolls \\n\\nBelow par on every way.  No experience needed to work here","label":0},
	{"text":"I seriously don't know why people love this place so much, the food here is horrible. The rice is never cooked properly.. And it's not even Asian food. It's fake asian food. I never come here anymore.","label":0},
	{"text":"It's the same Panera food you've had before.  I like the other ones better as they are often  faster at preparing food than this one.  That said the food is fine and the staff is nice enough.\\n\\nThey have warm cookies for $2.00.  That is a nice feature.","label":1},
	{"text":"Panera bread has to be the most inconsistent restaurant I have ever been to. I have posted two pictures of the strawberry poppyseed chicken salad. The first one looks delicious the second one looks like they could've used a smaller bowl. It did not even look appetizing.","label":0},
	{"text":"Watch out when it looks like something is on sale.  They mark a rack or table with a big buy one get one or 50% off sign, then only some of the stuff on the rack is on sale.","label":0},
	{"text":"This store has such bad service. The service staff are rude rude rude.  Save your money, shop elsewhere.","label":0},
	{"text":"This is a very small, yet nice store. The associates are nice and helpful. Not much else to say about this particular store. Just a pleasure to purchase from...","label":1},
	{"text":"Much like every other Eat 'n Park (3 or 4 stars worth of chain-diner food), except the last five times I've been here, the service has been damn, damn, daaaaaaaamn slow.  It's always fun to see the staff smoking out back while I've waited an hour for some scrambled eggs.","label":0},
	{"text":"God i hate eat n park. Only reason i have gone is for the salad bar because u cant find a decent salad bar in this city. Just about every entree iv had here is nothing more than rubbish, except maybe the cheesteak. Only go if u have little kids","label":0},
	{"text":"Excellent service, great meal!  They had an excellent selection of seafood,  and I can't wait to dine again","label":1},
	{"text":"Went on a Saturday, 2 hour wait. food is good, I got some seafood gumbo to go and I won't do that again. Seemed like it didn't have any seafood in it.","label":1},
	{"text":"Service was slow, but that was because one of our party insisted that the bartender, her favorite server, serve us in our private room for a party of 8.  The food and drinks were good and we woud return.","label":1},
	{"text":"Service an atmosphere was great. I had the shrimp boil and it was very under-seasoned. Much closer to bland than anything.","label":0},
	{"text":"The service was mostly friendly but I was disappointed in my meal. My meal was way over cooked. The soda was flat and the carbonation needed changed and I felt like we inconvenienced our server by asking for new ones.  Overall, I thought it was mediocre and I was expecting more for the prices.","label":0},
	{"text":"Food was only ok. Had lobster bisque soup not to good. Had the shang Hai Seafood Sampler. The scallops were hard, over cooked. The samon was good. Shrimp had no flavor. I will say the service was the best. Our waiter was great!!","label":0},
	{"text":"Love this place - they were very accommodating to me, Peanut and Gramma (she goes often).  Solid wine selection and Gramma says they make a good Margarita.  We all enjoyed all of our food as well.  Great view of the Mon too.","label":1},
	{"text":"I love old navy clothing, it's vintage styling with good prices. Great jeans too, I love the painter's jeans.","label":1},
	{"text":"This place makes AWESOME pizza. Also, their Italian hoagies are great. The only problem is that they do not open until 4.","label":1},
	{"text":"These pierogies are one of my favorite things in the world. They're freakin' amazing. The potato and jalapeno ones are my favorite. And I definitely think it's worth it to drive all the way out to McKees Rocks to get them. I like to get them frozen, and bring them home and smother them in butter.","label":1},
	{"text":"Update: Get. The. Italian. Sausage. Pierogies. Holy crap. It will change your freaking life!","label":1},
	{"text":"Just finished a dinner of pierogies that our Pgh family brought to WV - always look forward to Pierogies Plus - try the apricot for a sweet treet!","label":1},
	{"text":"Great service, great food at a reasonable price!  The cheeseburger was as big as my head and delicious and the onion rings were just as good.  Our waitress was friendly, attentive and quick to refill drinks. Can't wait to go back!","label":1},
	{"text":"Great small town breakfast spot Highly recommend George's Mixed Grill ... Delicious","label":1},
	{"text":"They do great quality work. The only reason I did not give them five stars is for their lack of customer courtesy not once but twice. I am a very patient and understanding person, but being rude twice means you dont want my business and I tipped 20%.","label":0},
	{"text":"Got my first tattoo here in 1993 and my second a couple weeks later. All these \\nYears later they still look great. Haven't faded much and haven't\\nHad em touched up. The shop is Professional and clean, I highly \\nRecommend. Excellent quality work.","label":1},
	{"text":"i had a fantastic experience here. I got to the shop just before they weer about to close, but the owner was very gracious about creating an arrangement for me. The flowers were lovely. I would make a special trip just to purchase from this shop again.","label":1},
	{"text":"Excellent pizza - although the mushrooms were from a can. But the crust , sauce and rest of toppings on the Sicilian pizza were delicious. Nice family friendly","label":1},
	{"text":"Just ordered delivery from here. The soup was very good. I also would Recommend the specialty salad. I also was surprised at how quickly the order was delivered. It was delivered within a 1/2 an hour.","label":1},
	{"text":"This place has great tasting food. I had a italian hoagie and it was great. The pizza is top notch.","label":1},
	{"text":"I have never gotten an order correct from this specific McDonald's. I'm not sure what the problem is, but it is never, ever right. It is never quick. The staff is always rude. After trying at least 12-15 times over the past year, I've finally given up hope on this place. Do not recommend.","label":0},
	{"text":"Delivery is slow and not even close to the best Chinese in the area.  No matter if it's rice or noodles or chicken or pork, everything tastes off--like it's been overcooked in mop-bucket-water.  Try House of Lee instead.","label":0},
	{"text":"If you have any common sense at all, please don't stay here.  Once, it almost burnt down...and I'm pretty sure most of the locals were chanting \\\"\"burn, baby, burn.\\\"\"","label":0},
	{"text":"Horrifying.  This place should be ashamed of itself.  DO NOT STAY HERE.  Beyond dirty, just absolutely rank.","label":0},
	{"text":"I can't even rate this place! Its absolutely disgusting! I begged the health department to shut them down! I was forced to stay a night here and it was so disgusting! I woke up with bed bug bites all over my body! Just filthy! DO NOT STAY HERE!","label":0},
	{"text":"Fair prices but good quality... And amazing designs that are custom made.... Plus gel and solar nails are available for those interested... Offers waxing services... Completely renovated and the spa pedicure chair is amazing...","label":1},
	{"text":"I got a pedicure here. Not bad, they were pretty thorough. But two days later both of my big toes were infected and oozing pus where she trimmed my toenails on the sides (which was weird anyway). I hate to rate a local shop down, but man my toes hurt.","label":0},
	{"text":"Yes!!!!!!\\n\\n\\n\\n\\nGreat service!\\nGreat Food!\\nLove the BYOB!!! ($5).","label":1},
	{"text":"My daughter CAN'T pass by here without asking to get something.  All I can say is you had better bring your sweet tooth!","label":1},
	{"text":"Got a key lime pie from this place. It was horrid. Icing was stale cake thick, crust was not even crunchy or had taste, and the key lime was weak. Pie looked it it was sitting out for a day or 2.","label":0},
	{"text":"Everytime I eat at this location I end up with a sick stomach.  I don't have that problem at other Arby's.  The dining area is clean and everything else seems ok but I always get a sick stomach.  Maybe they should relook at their food prep.","label":0},
	{"text":"Prices not great for true thrifters. Staff completely useless. No dressing rooms. I simply have nothing to say about this place.","label":0},
	{"text":"I had one of the breakfast specials and it was fantastic. There was also a continuous flow of coffee, which is always nice. Probably just missed the church crowd so it wasn't too busy either. Definitely a good breakfast spot.","label":1},
	{"text":"First time here and I wasnt impressed at all!  I should have gone to the dairy queen :-(","label":0},
	{"text":"Love these guys! I have a huge picnic every year for my job, and I always use Pistella for my beverages.  They're nice folks, always get the order right, and it's on time.  I've also been to the store itself many times, and they do indeed have a great selection.","label":1},
	{"text":"Animal Elegance is not much on the outside but the owner was very nice & LISTENED to how I wanted my teacup poodle groomed and used the products that I requested.\\nI was very happy with my services and I will return. \\n My poodles groom was $50,including tip, which I think is very reasonable.","label":1},
	{"text":"I've been told several times that this place had a great brunch.  Upon arrival, the menu was very limited and the service was abysmal despite a nearly empty restaurant.  We literally waited 15 mins. at our table and then left prior to ordering.","label":0},
	{"text":"Bland food and poor service. Its a shame since it's a great location and could be much more, especially since there is always overflow from nearby point brugge.","label":0},
	{"text":"this place had a great selection. The mussels were outstanding and the staff was very professional!!. TRY IT YOU WILL LIKE IT!!!!!","label":1},
	{"text":"The food here is ok but not worth the price. $15 corking fee? $9 a glass of garbage wine? Me thinks not.\\n\\nWhat really tops it off is the owner is beyond rude and doesn't care about the business. I heard it used to be much better but now I don't know anyone who eats there...","label":0},
	{"text":"Nice atmosphere with above average food. This restaurant has a lot of potential. The wait staff was far below average: They were slow, and we had to ask multiple times for things. They were not the most polite wait staff, and our waitress was either a little demeaning or very socially awkward.","label":0},
	{"text":"If you don't like your food... do not send it back to the kitchen... The \\\"\"Chef\\\"\" will come out and scream at you... Stay away from this place.","label":0},
	{"text":"Love this place, really nice people willing to help and pretty decent prices..","label":1},
	{"text":"Been yelled at by other customers (today for instance)...place is super ghetto...avoid at all cost. Today, left a full cart bacause a woman (with a baby in a stoller) shouted at me for \\\"\"cutting in line\\\"\". Will never go back. At night it is a nightmare.","label":0},
	{"text":"Tasteless food that arrived over an hour after it was ordered and was cold.  Will never order from here again.","label":0},
	{"text":"Oh I love this place. Their pizzas are square/rectangle! A single slice is a little pricey for the size, so if you're going to go, get a whole pie. It is in the strangest location (Home Depot's parking lot)!! The picture of the founder is adorable and hilarious. Love this place!","label":1},
	{"text":"This is great, simple, traditional italian american food. The salads are good. The pizza is really great (I stopped ordering from anywhere else).  The veal cannelloni is awesome too.","label":1},
	{"text":"Mikes took my car after horrible repairs/service from Kenny Ross South.  The service was great and I even got to meet the owner who came out to personally speak with me on a busy Friday afternoon.  Great guys there.","label":1},
	{"text":"Vincent has done several hems and jacket alterations on men suits for me. Items have always been one time and done well. I would recommend this place to anyone searching for a tailor in Pittsburgh. \\n\\nIt does seem a little expensive, but worth it, because its done correctly.","label":1},
	{"text":"Tire replacement, was told it would take about 1.5 hours (when I had an existing appointment). It's almost been 2.5 hours and I'm still waiting. Ridiculous.","label":0},
	{"text":"I'm a lawyer in NY and I'm visiting a friend in Pittsburgh. I am blown away by the code violations in this unit. The tenants said they have reported these issues to the owner and to no avail. I am hoping to direct these tenants to a lawyer in PA.","label":0},
	{"text":"One of my favorite coffee places in Pittsburgh. THey also have pretty good sandwiches and salads if you are looking for some light lunch food. Otherwise, they have plenty of pasteries/cookies to eat that are pretty good.","label":1},
	{"text":"Some of the best coffee I've ever had.  Ever.\\n\\nStick with an Italian Cappuccino and bring a good friend for some good conversation.","label":1},
	{"text":"Good coffee!! The atmosphere is nice, it was good to get out of the cold when we took our walk :)\\n\\nThe coffee was good, and not too expensive.","label":1},
	{"text":"BEST COFFEE IN PITTSBURGH!\\n\\nYou might think there is better coffee elsewhere.  You're wrong!\\n\\nI love this coffee shop, and there is a second location the Gates Building at CMU that I like to go to--their panini are to die for.\\n\\nI love this place, and you will too!","label":1},
	{"text":"Really hard to find a good cup of coffee in the states... I'd say this is the best  cappuccino I've had since Italy.","label":1},
	{"text":"The food here is okay.  Wings, BBQ, Bar foods. The floor here is always super slippery.  It doesn't matter if I am wearing heels or sneakers.  I just don't get why the floor is like and ice skating rink.","label":0},
	{"text":"Good place to watch a sports game.  Beer specials were good. Food is very overpriced though.  The wings are about the worst I've ever had... and I've had alot of wings growing up in Buffalo, NY.","label":0},
	{"text":"Loved the hot vegetarian sandwich. Not easy to find veggie dishes which don't feel like a compromise. This was great. Excellent service from waitress Ariella with the long black pony tail (don't know her last name). Nice casual atmosphere. Resonable prices.","label":1},
	{"text":"Watched a bartender serve a guy a beer when he was visibly intoxicated. He was swaying in circles on the chair next to me. I told the manager about it and he told me \\\"\"that guy is just crazy, I've seen him much worse\\\"\" so I guess that makes it ok. Made this paying customer leave after one beer.","label":0},
	{"text":"Wings are overpriced. And the quality of them are bad. They were tough and greasy. The staff are pleasant but then over all experience was too expensive for a sports bar.","label":0},
	{"text":"That is a great cat they have working, but they only have 3 brands of cat food, all of them expensive.  Funny enough though not as expensive as what I was looking for.  They followed me around like I was going to stuff my pockets and that just ruined the whole mom and pop thing.","label":0},
	{"text":"I had to get new tires mounted and balanced and when I went to pay, the guy at the register actually says something to the effect of \\\"\"Do you have any idea what this is supposed to cost? So, I could charge you $400 and you wouldn't know the difference?\\\"\" Joking or not, why even go there?","label":0},
	{"text":"Made an appointment for 3:30. They completely forgot I was coming but said they could start on my car in ten minutes and be done in an hour. Came back an hour later only to see my car in the same spot. They said it would take another two hours to start work. Completely unhelpful and unapologetic.","label":0},
	{"text":"The new manager, Ray, was really friendly and helpful. Had to diagnose something with my car-done quickly. I usually go to the Monroe in Wexford, this one is just as great! Thank you!","label":1},
	{"text":"I wish we had a way to hold this corporation accountable for its crimes against our society.","label":0},
	{"text":"Walter's garage is awesome!  I was in real trouble with my car and needed immediate repairs and he managed to fit me into his busy schedule and charged a fair price for the work.  He was kind and honest--what more could you ask for from a mechanic?  :)","label":1},
	{"text":"Went to Walt's Auto for an inspection after seeing all of these great reviews on Yelp, and was so happy I did. I will be taking my car and my husband's truck here from now on. The service here cannot be beat!","label":1},
	{"text":"Walter's is the best and most honest mechanic I've ever worked with. They are super busy because they are so great, so they have no need to do unnecessary repairs. Can't speak highly enough of quality of their work and integrity!","label":1},
	{"text":"Finding a decent, honest auto mechanic is always a battle. I can't stress enough how amazing Walter and his team are. They are very friendly, personable, honest hard working people. I would never go to another garage in Pittsburgh. I can't stress it enough!","label":1},
	{"text":"Combinacion!\\nThis place is the shit for real.\\nWhere's the Patron at???\\n\\n(b)","label":1},
	{"text":"Enjoyed the winter solstice concert Saturday night. Fun scene, cover benefited charity, drinks were decent (nothing spectacular), but the grilled cheeses moved this review from a three to four star rating. Fun night, cool spot. Will go back!","label":1},
	{"text":"I agree with Stacey B. I am not cool enough for this place. I Spoke with Jay Malls briefly, and he was indeed cool ,This is one of the best R&B DJ's since Venus Flytrap. (from \\\"\"WKRP in Cincinnati\\\"\" )\\n\\nI hope to stop in again soon . It is worth the trip.","label":1},
	{"text":"Waiting 20 minutes to get one piece of wood cut in an empty store on a Friday afternoon.  Priceless!","label":0},
	{"text":"Fairly mediocre, even by the relatively modest standards of Home Depot. Unfortunately, this is probably the best you're going to do for hardware in most of Pittsburgh.","label":0},
	{"text":"Tried using the online order store pickup with the hopes of increased efficiency.  fail.","label":0},
	{"text":"Great for a quick cut.  $22 for extreme attention to detail and excellent finish.","label":1},
	{"text":"This is the greasiest pizza I've ever had in Pittsburgh, I couldn't eat it.","label":0},
	{"text":"Provolone sticks arrived undercooked, cheese was fully solid, they tasted okay. The pizza also arrived undercooked, the dough itself was partially uncooked in the middle. I had to put it back into my own oven to finish it off, and then it was greasy and just okay.","label":0},
	{"text":"This was one of first pizza places that I've tried inPittsburgh. It was about 5 years ago. I don't have a clear memory of that time but I have Parma pizza phobia ever since... So go figure...","label":0},
	{"text":"Compared to other Whole Foods locations, this one is tiny! For comparison, the Whole Foods in Las Vegas must be at least three times the size. Still, it's nice to have and it is pretty decent overall albeit pricey.","label":1},
	{"text":"Food poisoning a la Tomato Bisque Soup.\\n\\nForever skeptical.\\n\\nThat's too bad, I don't mind paying extra for better produce or better brands. But, I KIND OF mind getting extremely sick, so sick that anything I ever would vouch for goes down the toilet, with my vomit.","label":0},
	{"text":"Great selection of vegan, vegetarian, raw milk, prepared foods, bakery, cheeses and aged beef. Very expensive, trader Joe's and Market district come to mind as a cheaper alternative. Parking at this particular store is a nightmare.","label":0},
	{"text":"Now with two new bee hives along the rail line as of July 2012 managed by burgh bees of Pittsburgh","label":1},
	{"text":"This club is now officially closed for good due to redevelopment in the area.","label":0},
	{"text":"Best chiropractic center I been to others Dr Novak and staff are the best in the Pittsburgh area they are concerned and problems always taken care of excellent adjustments  I always feel better after I leave there","label":1},
	{"text":"As the reviews of Casbah appear to be particularly long-winded ... the place is nice, fancy, organic-ish, alternating menu, nice atmosphere. Good date restaurant. Good food-lovers restaurant.","label":1},
	{"text":"There is a disconnect here between this name, the decor and the food. That said, I had the best pork chop I've ever had here and for that I was endlessly thankful. Good salad, delicious bread and hummus. Great service. For Pittsburgh, top notch.","label":1},
	{"text":"great atmosphere and great food. while the menu changes seasonally, my group all enjoyed the food - crab/scallop pasta, pumpkin risotto and rare tuna.\\n\\ncasbah also has a great wine list, and great service that is there when you need them, but doesn't annoy.","label":1},
	{"text":"Out of towners that happened to stumble upon this gem. Thanks, Siri. Wow! What a great experience. Fantastic, wine, food and service.","label":1},
	{"text":"Very expensive for a college student, but quite good.\\nI would recommend this if you enjoy European food in general.","label":1},
	{"text":"This place was recommended by an employee at Evolve spa across the street and I was very happy with the restaurant. The Salmon appetizer was delicious as was the gnocchi meal. I will definitely go back to this restaurant when I visit the area.","label":1},
	{"text":"Ate lunch at Casbah for the first time. Tried the Piccolo Gusto: $15 gets you a small choice of salad, a half sandwich and a half portion of a pasta or risotto. Great deal and fantastic food. Argula salad, shodt rib sandwich and wild mishroom/truffle risotto. No need for dinner today!","label":1},
	{"text":"It's a little pricier than most places in the area but the quality and ambiance is well worth it.    The food was really good and the drinks were relatively reasonably priced for the surroundings,  great place to take a date...or spouse.","label":1},
	{"text":"- Great food. I had the Gerber's Amish Farm Chicken Breast and it was cooked perfectly and delicious =]\\n- Nice wine selection. Though I'm a beer guy.\\n- Friendly staff.\\n- Okay atmosphere.\\n\\nThis place is definitely worth trying. Will be back for seconds!","label":1},
	{"text":"My absolutely favorite dish is the potato gnocchi. Just amazing! Service is fantastic, nice decor. I wish they wouldn't use such huge paper towels in the bathroom, but other than that I really like this place.","label":1},
	{"text":"I recommend the short rib ravioli! Totally the best thing I've had in a long time.","label":1},
	{"text":"Fun, unique atmosphere (hippie / indy / hipster / whatever these kids are calling it these days). Interesting, tasty food. Above all, awesome retro decor. A Pittsburgh treasure.","label":1},
	{"text":"Yes, it is reasonably priced.  Yes, my food was tasty (6 on a scale of 1-10).  However, the place did not look clean to me--I won't be back because of that.","label":0},
	{"text":"Tasty horchata - dessert before the meal of veggie Cuban with smoked tempeh ... Yum!\\nCool funky space with low key music & friendly waitresses with plenty of tats","label":1},
	{"text":"It's cheap, I'll say that, but otherwise it's bland food served by workers who mostly don't seem to notice they're working, and when they do, only respond snarkily. There are many better vegetarian and vegan options to choose from.","label":0},
	{"text":"Delicious!! Not a vegetarian, but this place might convince me to switch over. Had a few breakfast options and was blown away by the Greek plate and the QTF. Excellent coffee too.","label":1},
	{"text":"DO NOT ORDER THE HOT WINGS!! If you enjoy eating hot sauce flavored gravy paste, then by all means these are the wings for you. If not, stay away. My boyfriend and i each ate one and couldn't even finish the rest of our dinner. Don't waste your money!","label":0},
	{"text":"Got the rancho and the Greek, not so bad but I probably won't go back... Too heavy for me...","label":0},
	{"text":"Don't be fooled by the humble exterior:  their food is delicious!\\n\\nBetter than Pizza Sola.\\n\\nIts my favorite pie in Shadyside, and their hoagies and gyros are also delicious.","label":1},
	{"text":"Frick Park Market's extensive selection of Boar's Head meats and cheeses, Breadworks baked goods, and homemade soups makes it a solid choice for a simple, inexpensive lunch.  Prosciutto and capicola with lettuce, tomato, and banana peppers is a personal favorite.","label":1},
	{"text":"Used to live two blocks away and now I miss having it so close! Great sandwiches, and would always get my weekly bag of coffee and milk. The owners are friendly and helpful.","label":1},
	{"text":"i'm all for recycling / re-using/sustainability but a lot of the items in here are just ... junk / ugly crap that no one with any real aesthetic taste would want in their home.\\nprobably better for sourcing fixtures for industrial / commercial spaces ...","label":1},
	{"text":"I love this place. If you have a project that is on a budget or if you just want to go somewhere to get inspired to start a project than this is the place for you. They have everything here including the kitchen sink.","label":1},
	{"text":"I like this place but the hours are inconvenient (top roping doesn't open until 5PM during the week!!!!) I wish they would expand their hours. Otherwise, they make a nice effort to change their routes relatively often.","label":1},
	{"text":"Sub-par setting quality, infrequent wall resetting, inconsistent grading, poor climate control, poor air quality (no chalk filter), silly rule where they make everyone wear paper wristbands before entry. + 1 star because they are finally installing air conditioning.","label":0},
	{"text":"The ventilation in the bouldering area is terrible. Please install some chalk eaters. People are inhaling tons of chalk into their lungs and are going to get pneumoconiosis from climbing at your gym.","label":0},
	{"text":"Service was okay, at best. I wouldn't go there again.  They quoted me at thousands of dollars of repairs for my car to pass inspection.  I took it somewhere else and had it done for a fraction of the quote.","label":0},
	{"text":"Don't go. I got more problems and sounds on my car after I spent $800 there. unbelievable!","label":0},
	{"text":"I've eaten here once after having it suggested by numerous people, I was totally disappointed with the service, food, and the place itself, I will not be headed back......ever\\nSave your money, or starve either would be a better option","label":0},
	{"text":"Awful facial with lulu. Used a groupon and thought it may be why she was so terribly unattentive, but realized she had no idea what I was paying with. Basically I got the 'steam machine' blowing on my face for 40 min!  \\nWould give negative stars if I could.","label":0},
	{"text":"This place is a great Ice Cream Shop. My Favorite is the birch beer float. Delicious and under $2. A blueberry shake was made with real blueberries. Really, I haven't had a bad item here. Just make sure you bring cash, that's all they take.","label":1},
	{"text":"Whoever doesn't give Page a 5 has no soul. It's childhood everyday March-October. I love the pretzel cones, but everything is good.","label":1},
	{"text":"Mmmmm. Their Egg drop soup is sooo good as is the General Tso's, and they deliver FAST!","label":1},
	{"text":"Horrible - they use chicken that's been out uncover all day . And they smoke around the food.:(","label":0},
	{"text":"Maybe I went on a bad night, but the service was stunningly bad.  Water glasses stayed empty for almost 15 minutes!  Ordered 5 dishes, all pretty average.  The tab:  $300+.  I won't be back.","label":0},
	{"text":"Seated in the bar after having made reservations a week in advance. That, paired with a mediocre menu and overall experience, gives this two stars. Save your money and stay in town. I would probably send you to the (gasp) Olive Garden before I referred you here.","label":0},
	{"text":"Just recently returned. PHENOMENAL meal! Glenn our waiter was superb. Loved the veal dishes.  I also enjoyed the new cocktail menu. One of the drinks was iced coffee with orangicello and frangelica cream. DELICIOUS!","label":1},
	{"text":"Well, the delivery was fast at least. Everything else was yucky. Avoid!","label":0},
	{"text":"Best rates and deals. I now live in Arizona and still bank with dollar bank because I've been so satisfied with the offers and customer service!  Free ATM service nation wide, 1% interest on free money savings account and they give me .10 when I use my debit card.  What more could I ask for?","label":1},
	{"text":"Had chicken salad. Was good but very pricey. Their pizza is about 20-30% more expensive than any comparable pizza in the area. And since the pizza is just mediocre it is definitely not a good value so I'll pass!","label":0},
	{"text":"Great service, excellent place to get breakfast at any time of the day","label":1},
	{"text":"I went here for Bluegrass night following Banjo Night at the nearby Elks Club. What a fun night!!! It is a very fun, friendly, music-loving environment. I believe this happens every Wednesday, so definitely check it out! I will be back for sure!","label":1},
	{"text":"Up-charges most of their products that you can find on B&H for way less money. Sales person treated me like I was a very inexperienced. Not a bad place if you're in need of camera gear without a moments notice, but overall definitely order offline.","label":0},
	{"text":"Want a taste of the old ethnic communities of Pittsburgh? Go to Max's Allegheny Tavern. German never tasted sooo nice!\\n\\nMenu Fav: Potato Pancake Reuben. Forget the bread and wrap your lips around sweet potato pancakes and loads of corned beef. Try the hot potato salad too.","label":1},
	{"text":"I am a big fan of Max;;s for their local flair, real German food, and authentic Pittsburgh feeling. They did not sell out, are not overly commercialized, and should be supported for the long standing quality service to the city. Thanks, Max's.","label":1},
	{"text":"I must of been eating at another Max's in a pararell universe!\\n\\nFood was terriable, service was worse! Went and got Sushi!","label":0},
	{"text":"Nice lil bar/restaurant with awesome staff.\\nMy favorite thing about this place: The staff.\\nFriendly, kind and super nice.","label":1},
	{"text":"Overall great German food!  I love the liver and onions above all else.  The kase spatzle is delicious, and you can't eat at Max's without an order of soft pretzels!  !","label":1},
	{"text":"This is my favorite place to go when I'm in the steel city.  The atmosphere is awesome and the staff is very friendly.  The beer sampler and Ruben is a solid choice but they also have a wide range of other options including hasenfefer and Wiener schnitzel.","label":1},
	{"text":"The best sandwiches at amazingly great prices!  The man who owns this is super nice and so helpful!  One sandwich feeds 2 adults and will fill both of you up.  The closest thing to a New York Deli in this area.  Go in here once and you will be hooked.","label":1},
	{"text":"Great european style boutique hotel.  You can not beat this hotel for the money!","label":1},
	{"text":"Best in Pittsburgh hands down. Pumpernickel raisin rolls are my favorite, the ciabatta is awesome...salt sticks too. They have just about anything you could think of and it's always bakes fresh that morning.","label":1},
	{"text":"Went here a couple Fridays ago to go to for lunch. Pretty cool place and the food was pretty good. I had the sausage platter, sauerkraut, coleslaw, and red cabbage...mmmmm! I can't wait to go back and try some other dishes. My only complaint is that the beers were a little small.","label":1},
	{"text":"what can you say? just have a lot of time to spend! because its soo packed with all sorts of great works and exhibitions! dont for get to take art classes! especially if you have children- there are a lot of things to do.","label":1},
	{"text":"This collection is extensive and covers so many styles and periods, there is bound to be something that grabs you. The setting alone is worth the trip. On a clear day you can see all the way from the skyline to the ocean. The gardens are a delight also.","label":1},
	{"text":"Heinz ketchup and pickles are terrific.  It isn't worth trying to save a nickel with watery condiments.","label":1},
	{"text":"Estimated delivery time 45 minutes actually delivery time 120 minutes.\\n\\nPizza Hut , a pizza of last resort.","label":0},
	{"text":"Ordered online and couldn't believe how fast the food came. Their honey garlic boneless wings are delicious.","label":1},
	{"text":"So Pittsburgh! This is such a neighborhood gem! We took my grandmother here for her 82nd birthday and had such a good time. Nothing too fancy, just good 'ole Italian food, made in the kitchen right in front of you.","label":1},
	{"text":"Very good home style Italian... Very friendly staff. You should bring a bottle of red to go with your dinner... Worth it!","label":1},
	{"text":"Awesome, cozy place. It has a friendly, family style atmosphere. The food is consistently great. The servers are inviting and seem genuinely happy to be there. \\n\\nI love going here on a whim. So if you're looking for a great new place to go tonight, try it.","label":1},
	{"text":"Small, overcrowded, unfriendly staff.\\n\\nThe food is okay - typical Italian fair that could be better seasoned. \\n\\nThere are much better options nearby, but in a pinch, it's decent.","label":0},
	{"text":"Very cool place to have a nice dinner.  I always go for the mussels-delicious!\\n\\nPasta is always fresh and tasty, too.\\n\\nFriendly wait staff.  This would be a five-star if they were able to serve adult beverages.","label":1},
	{"text":"Awful.  Worst grocery store I've ever been to.  To make it worse, they are supposed to open at 7.  At 7:10, I was told they were \\\"\"still getting ready to open\\\"\" and I should come back \\\"\"around 7:30\\\"\"","label":0},
	{"text":"So I got a call from Giant Eagle asking me to give my opinion of this store. My recommendation was to burn this place to the ground. Buckle up for crappy produce, rotten fish, old meat, and security guards that speck you be stealin! This is the Gh**to Eagle!","label":0},
	{"text":"Dave's Barber Shop is good old fashion at its finest!!!!  The convo was perfect, sports and everything in between....cut and price also very nice....","label":1},
	{"text":"The problem with this dry cleaner is poor counter service.  I have never been treated in such a poor manner - and the sad part is that this SERVICE provider doesn't care.  I recommend going elsewhere.  They are not worth my money.","label":0},
	{"text":"Best Cleaner in Pgh.!  If you have quality clothing , and want your clothing to look beautiful after being cleaned go to Pfennings !!! Excellent services !","label":1},
	{"text":"really great place to bring kids. brought my 2 year old here on vacation and she had a blast. Her favorite parts were the painting room and the water room. a must visit if you have kids.","label":1},
	{"text":"Can't get an order right! 6 of the last 8 times we ordered they have messed it up.   I know, each time I forgive them and think they can't possibly mess up again, but they do.  Not only that, but they quote 45 minutes then take anywhere from 1-2 hours to deliver.  Wont be ordering from here again!","label":0},
	{"text":"Pickles looks like a dive. The bathroom is a disgrace to mankind. The clientele...or should I say the non-client, just sitting there bothering paying customers, are a little off putting. \\n\\nBUT, the food is awesome... I would not want to look too closely into the kitchen... but the food is awesome!","label":1},
	{"text":"Here we go, Steelers, he we go.  Pittsburghs goin' to the superbowl!\\n\\n\\n\\\"\"Y'ins kicked ass this yir, playin dawn-tawn at the new stadium.\\\"\"  \\n\\nI love you, the best things about Pittsburgh- ever.","label":1},
	{"text":"I'm  not crazy about football but it's a nice stadium and fun to come with other people. The games are fun and the fans are great they are very into the game which fans should be.","label":1},
	{"text":"Thanks Steelers for a great 2010 season, even though WE came up short in winning our seventh championship, you've made this city proud! We'll do it in 2011 and Super Bowl XLVI in indianapolis! Here we go Steelers, Here we go!!","label":1},
	{"text":"Perfect experience for this Steelers fan from Maryland. Had the walk up tour, tour guide knew exactly what she was talking about with a great personality to match. Had a really great time :)","label":1},
	{"text":"It's cathartic to give this sorry organization 1 star.\\n\\nNote: this is a review of the baseball club, not the stadium in which they play","label":0},
	{"text":"We're over .500 so far this year!  Whoo-hoo!  We're actually mediocre!  And for once the Cubs are keeping us out of last place instead of the other way around!","label":1},
	{"text":"I love the buccos, win or lose.  Going to the games are always a good time, and when they are on TV at the bar, I always find myself happy to enjoy my meal and watch the game.  Gotta love them battling bucs.  Please just let me see one round of Playoffs in Pittsburgh before I die..","label":1},
	{"text":"I wouldn't pay attention to the Trib's news coverage, since it's mostly far-right propaganda. Two stars for their decent sports coverage - Mike Prisuta and Joe Starkey are worth reading.","label":0},
	{"text":"This conservative POS rag makes faux news look like NPR. You got Scaife, himself pumping ten million a year from his own pocket to keep the paper up and running. No one reads it, the Post Gazette is the REAL newspaper in this city.","label":0},
	{"text":"Nick's used to be good with the previous owner, that all changed. Which is pretty sad.","label":0},
	{"text":"This place is fantastic!  Very reasonably priced, they do a wonderful job with my German Shepherd.  Nails, ears, bath, and grooming- she looks like a new woman when they're done with her!","label":1},
	{"text":"been ordering chubbys for over ten years.  solid pizza at a great price.  one time, steve offered to deliver a pizza over an hour after they closed on xmas eve just because.  doesnt get any better than that.","label":1},
	{"text":"Ordered a lg pizza for pick up, 30-40 min wait. Went to pick up my pizza and I arrived to have no pizza at all. They told a driver must have taken by accident. The skinny, is it took an hour for a new pizza, and they offered me nothing","label":0},
	{"text":"We had food delivered to our house last night from Knossos. I tried their pierogi which I found to be quite good. Also tasty are their broccoli bites and their huge ice cream sandwiches (homemade). Very recommended!","label":1},
	{"text":"Very disappointed. Delivery was late, our gyros were cold and fries were soggy. I wont be ordering from here again.","label":0},
	{"text":"Awful poor excuse for a gyro. Food is always soggy. Meat is pure horsec*ck. Very unfriendly staff, but what do you expect from Greek f@ggots. Will never order from here again, total trash.","label":0},
	{"text":"Love this place.  I used to live within walking distance and that was a treat!  Karaoke is a great time.  The drinks are great and inexpensive and there are always great people to meet there.\\n\\nI miss the pickles.  ;)","label":1},
	{"text":"This place is terrible and the management has acted like an entitled prick every time I was there lol... Id rather get shot at R Bar","label":0},
	{"text":"What a hidden gem in the South Hills. This fun Little store carters to a wide range a spiritual curiosities. You can explore your psychic side with a modest selection of power crystals, tarot cards and scents. I found the selection of books to be helpful and spanned a wide range of interest.","label":1},
	{"text":"Kuhn's automatically receive 1  for being open 24 hours. Beyond that, customer service has been great, the shelves are stocked well, prepared food and deli items are better for you than fast food with better ingredients at a better value! When I'm in the the are, this is my go-to shopping spot.","label":1},
	{"text":"Really nice place.  We shop here all the time. great service, great selection.","label":1},
	{"text":"Absolute best place to buy a quality bike in Pittsburgh. The staff really loves cycling and shares their extensive knowledge with you to help find the best bike for you. I didn't feel like I was being up-sold anything. I really trust this place. Frequent customer for life.","label":1},
	{"text":"Nice, quiet neighborhood coffee bar.  However, the elementary school a block away gets out at 3:25, and from 3-4 it can be crowded with moms and younger siblings stopping in to pass the time.  Outside those times, it's always quiet with nice music and delicious pastries.","label":1},
	{"text":"Good coffee, nice walking street, good selection of teas and little gifty things, good pastries, *excellent* scones, and it's not that other green-logo'd coffee place.","label":1},
	{"text":"First,  I love CTR's coffee.\\nSecond,  this location has great batistas and it's less congested than other CTR'S I've been to. \\n\\nThat about covers it","label":1},
	{"text":"Another ugly haircut like everywhere in Pittsburgh. For $60 with the owner. Trusted the reviews, but now look like a Pittsburgh redneck. No hair on the sides and long on the back!","label":0},
	{"text":"sushi was dry and unenjoyable. the place itself is clean and the decor was minimal.  I was not a fan and probably won't be back.","label":0},
	{"text":"Yeah, don't order from here, unless it's for dumplings. since they arev fast and the potstickers are really good. Everything else we had sucked. Shrimp and Scallop with garlic was bland as hell. The Beef on a Stick was liked eating a marinated shoe with a skewer in it. Yuk.","label":0},
	{"text":"Pool hall and pretty crappy bar. Not much else to write home about. Was not a fan and won't be back here.","label":0},
	{"text":"I came in and a waitress came to our table , took our order and then walked away. Another lady came to us and asked what we wanted , then the first girl came back and asked us again!!! The restaurant has 4 people. This is not good! Write it down you dumb blonde","label":0},
	{"text":"One of the best pastries I've had in my life I got here. I think it's called a \\\"\"French bearclaw.\\\"\"","label":1},
	{"text":"Their baked goods are simple and DELICIOUS. The taste speaks for itself, no frills necessary. Potomac is the best bakery in the South Hills. \\nLifelong regular here and I will always be!","label":1},
	{"text":"A Dormont treasure!  We love their cookies and pastries, going there for goodies is a time honored special treat.","label":1},
	{"text":"Square Pizza is a great Pittsburgh area thing that alot of people just don't understand Beto's is new to me there is Tons of Cheese and Pepperoni and great Sauce very generous with toppings a little expensive but well worth it.  If you like this pizza try Osso's in Washington PA.","label":1},
	{"text":"Sorry, but our pizza was cold.  All nine cuts of it.  And the garlic wings didn't taste like garlic.  Maybe it was an off night?","label":0},
	{"text":"This was just bad pizza.  For the money I expect that the toppings will be cooked on the pizza.  The cheese and pepparoni were added after the crust came out.  Also the mushrooms were out of a can.  Do not waste money here.","label":0},
	{"text":"No way. A ton of cold shredded cheese thrown on top of pizza? No no no. No beer either.","label":0},
	{"text":"Been going here for years, and will continue...I agree with some of the others, you will either love it or hate it.. It's just different, but classic in its own way... Square cut pizza with cold toppings... So frigging good...just let the cheese melt.....","label":1},
	{"text":"Worse than store freezer pizza. What with the cold cheese on top of hot pizza? Terrible. If you want quality; Fiori's is a few miles away.","label":0},
	{"text":"Didn't live up to my expectations at all.  Waste of time and money.  Sloooooow service.","label":0},
	{"text":"Sweet little shop - great place to take the kiddos, and nice to see a huge selection of hand dipped cones and it's a nice departure from the yogurt bars.","label":1},
	{"text":"Mediocre and poorly made! You can get better quality food from Mcdonalds don't waste your time or money","label":0},
	{"text":"We come here a LOT and are usually quite happy. The fried pickles are ridiculously good!! Decent off street parking, good selection, open 24 hours and the staff is usually great.","label":1},
	{"text":"Who does not love a DQ Blizzard? And I heart the Girl Scout Thin Mint Blizzard. Next time, I will get the mini size. The small filled me up before I finished!","label":1},
	{"text":"Peanut Buster Parfaits rule! I'm glad we have one so close. Nuff said!","label":1},
	{"text":"It was our first visit to Cains and we were very pleased. Food was very good and reasonably priced. We will be back if ever in Dormont","label":1},
	{"text":"Great beer on tap selection.  Stopped there for lunch recently and had a salad that will bring me back there again soon.  Many, many TVs in the bar area, so this would be a great place to watch a sporting event.","label":1},
	{"text":"Great place to watch a game. Friendly staff went out of their way to get my game on even though the Steelers were on at the same time.","label":1},
	{"text":"I just moved in the neighborhood and don't have my laundry room set up yet. I went here to wash my bed sheets and it was a pretty typical laundromat. The woman working was very friendly and helpful (telling me the best machines to use for what I was doing)","label":1},
	{"text":"Went this this morning and I am wondering why the hell it tool me so long to go here. Awesome food, fresh and the staff was even better. Won't eat anywhere else for breakfast in the burg! Gotta get here","label":1},
	{"text":"OMG!  Hands down the best pancakes I have ever put in my mouth. Sometimes I day dream about Dor Stop pancakes.  Too bad I live 6 hours away or I'd go there everyday.  \\n\\nThe service was just ok, but the place was packed and the food was well worth the wait.","label":1},
	{"text":"Been here twice. Hate to say it but nothing special. The usual breakfast items but nothing stands out either in preparation or presentation.","label":0},
	{"text":"This place has some seriously good breakfast.  They have many good things.  The pancakes looked awesome and I would get them next.  I had the Guy's version of the jumbot and it was delicious.  The cinnamon rolls are great too!  \\nIt is a busy place for good reason.","label":1},
	{"text":"While the Dor-Stop is a cute place on a nice tree lined street, I'm not sure what the big fuss is all about. The food was only fair and they don't even have real cream for your coffee. It's that nasty fake nondairy crap. It also gave me the heebeegeebees due to the \\\"\"Christianesgue\\\"\" motif.","label":0},
	{"text":"Fantastic. Best hotcakes around and I've never had a bad meal here.  The staff is friendly and personable.","label":1},
	{"text":"Wow!!  My wife and I had breakfast at the Dor-Stop this morning and it was outstanding!!  We had about a 20 minute wait to get in but it was worth it.  The service was fast and the food was great.  We will surely return......","label":1},
	{"text":"I stopped by for lunch and had the steak salad.  It was pretty yummy but the steak had too much fat on it. The reason why I am giving it only 4 stars is because my steak was not done the way I requested and our waitress had zero personality.  I recommend going here for breakfast and not for lunch.","label":1},
	{"text":"A little biased since I live so close, but I love the Dor-Stop. Great, typical, greasy spoon diner. Always give the special a shot.","label":1},
	{"text":"Pancakes, pancakes, pancakes.  Everybody told me I HAD to try and their pancakes.\\nWell, the short stack they served me were lousy pancakes.","label":0},
	{"text":"Great Breakfasts!  Worth the wait to get a table since Diners,Drive ins and Dives had been there. Pancakes are very fluffy and waffles too!","label":1},
	{"text":"Great little local diner!! Must go if your in town.  Food was amazing and all made from scratch!!  Had the Pumkin Stuffed French Toast today!! Perfect size portions. Wait staff super friendly. Gets crowded, but never a long wait. Highly recommend.","label":1},
	{"text":"Great pie...I could eat a whole large though...if you like a thin crust, you will love this","label":1},
	{"text":"Disappointed after hearing so many good things. Pizza crust is like a cracker. Hoagie is pretty good, but does not remove the disappointment over the pizza. I think Molly's Pizza next door is a lot better....I won't order from here again.","label":0},
	{"text":"Loved the food! The food has a home made feel to it! \\n\\nYes, the old lady seemed rude. but we did not deal with her.  The cook (guy in apron) was very friendly and kept coming back to us to see if we need anything.","label":1},
	{"text":"Just to let everyone know, Namaste Indian Restaurant has moved (January 2013) from it's old location in the Banksville Plaza to 1150 Banksville Rd, adjacent to The Days Inn. I've notified Yelp.","label":1},
	{"text":"This was probably one of the worst places I've eaten at in a while . I'm not sure what was worse food or service . Never again , the coupon we bought and weren't allowed to use left on the table","label":0},
	{"text":"I wish I could give this place \\\"\"-5\\\"\" stars for its terrible food quality. Oily, greasy and bad taste. All 4 members of our party fell sick, throwing up and/or with a running stomach.","label":0},
	{"text":"Terrible place to eat and not very clean at all. Way over priced foe fast food. 5$ for a plain roast beef forget that!","label":0},
	{"text":"I'm not about reviewing fast food places, but I found out this Arby's was the first in Pittsburgh. It even has the HUGE cowboy hat out front as a marker. \\n\\nIt has all the stuff you'd expect, Roast Beef sandwiches, and those amazing Jamocha Shakes Arby's is known for.","label":0},
	{"text":"Sadly really went downhill. They switched to a new vendor, the prices went up and they are no longer having sales.","label":0},
	{"text":"One of my favorite hometown pizza places. Try the white pizza, you won't be disappointed. Great place to grab a beer on Beverly road and catch up with old friends.","label":1},
	{"text":"I just want to like it due to its location and great beer selection, but the food is awful.","label":0},
	{"text":"Love Bado's. Any pizza is really good and their rueben is very tasty. Lots of beer choices and they give out free samples.","label":1},
	{"text":"one of the worst steak sandwiches i've ever eaten. there were 7 of us and the only people who liked their food were the kids and the one who had the pizza. \\n\\ni would never eat here again","label":0},
	{"text":"The service is a little off and the staff doesn't seem very attentive to your needs. However the food is worth having bad service. They have a great selection of pizzas but my personal favorite is the buffalo chicken.","label":1},
	{"text":"I always get burgers and beer here even though they're known for their pizza. No regrets! Love their growlers too!","label":1},
	{"text":"Had the gnocchi delivered. Absolutely terrible. Gnocci's had to have been 2 years old. Delivery guy was shady too.","label":0},
	{"text":"I don't like this place at all. The staff here is always rude and has no sense of care at all for their business. A couple years ago I had heard they smoke over making their pizza. All of their employees tend to be shady. I don't recommend at all.","label":0},
	{"text":"An abomination....the billing department is run by a level of incompetence of which the likes have never been seen.  Ever get a bill 2 yrs late, then pay over the phone with a credit card, only to have the payment never recorded and then receive harassing phone calls?  Well I just did....","label":0},
	{"text":"Come here instead of D's if you need to buy cases of beer. They're cheaper than D's and everything is easy to find. Thanks to the peeps at D's for the referral.","label":1},
	{"text":"This place was great! I was a little bit let down by the Chicago hot dog as it had too much mustard. That said, however, I was really excited by the beer selection and the neon green relish. If you're looking for a chill meal, this is a great place to check out!","label":1},
	{"text":"Everyone is so nice, tons of different beers to choose from, including a mix your own 6 pack deal and, just 3 words, Mason Dixon Dog!","label":1},
	{"text":"D's is a fantastic place with food! Reasonably priced and a nice atmosphere! Can get crowded but that's because it's soooo good! I love the selection of beer, it always me to try out a new beer without having to buy a whole case!","label":1},
	{"text":"Crowded bar atmosphere, spectacular beer selection, good bar food.  Great hot dogs.","label":1},
	{"text":"The mac n cheese dog I had was just ok, but the Mason Dixon with its slaw and chili was killer. The fries and barbeque wings were just as good. I also liked the atmosphere, the mural, and the employees who were really nice and honest and helpful. It's in a cool neighborhood too. Go!","label":1},
	{"text":"I don't come here to eat much, I usually come for the beer cave. Best build-your-own six pack joint in the city!","label":1},
	{"text":"Hot dogs were delicious and fun to mix and match toppings. They do fried dogs too and it's great. Beer selection is obviously fantastic. Check our their beer cave!","label":1},
	{"text":"D'z dogs is the best. All the employees seem to want to be here. Nothing is better then when your food provider is excited about what he/she is doing. Come try a scorpion dog.!!!!","label":1},
	{"text":"Went here after a run in nearby Frick Park, which I felt gave me license to have a (delicious) hot dog washed down with a few great beers. I can't wait to return!","label":1},
	{"text":"Was at D's this afternoon! I was so excited to find real vienna Hot Dogs in Pittsburgh since I am a born and raised Chicago guy. They were good dogs, had mine Chicago Style of course! Not sure it was Pollmans Mustard. It the buns had poppy seeds! A great place with plenty of atmosphere!","label":1},
	{"text":"My favorite place in regent square.  you haven't experienced pittsburgh until you've had a hot dog and a beer at d's.if you go on thursday nights the typically have a different brewery featured where they'll have 5 or 6 of their beers on tap","label":1},
	{"text":"Best fries around and a really good beer selection.  A little bit of a drive for us, but we always find a reason to go.  The staff is beyond friendly","label":1},
	{"text":"I agree with others that the beer cave is wonderful.  I could stay in there for hours!  The pizza ain't bad either!","label":1},
	{"text":"Worst dry cleaners EVER.  \\n\\nNot only do they do an incredibly poor job on the clothes, but the staff are particularly nasty and rude.  The kids who work there are fine, but the older ladies are just plain miserable.  I would rather spend more money someplace else than go back to this hell hole.","label":0},
	{"text":"I really wanted to like this place, because it sounds like it used to be really popular. We heard the burgers were very good once upon a time, so we tried them, but they were just ok. Nice people though, and plenty of seating. Good place to watch the game probably (bar).","label":0},
	{"text":"Friendly and prompt service.  The French onion soup is great. The prices are a bit more than what one should pay for standard fare. Otherwise great place.","label":1},
	{"text":"The drive through service here leaves something to be desired.  Not only was my order wrong but the lady was very grumpy.","label":0},
	{"text":"This place continues to be a joke.  The service is bad and the attitude of the workers is worse.  \\n\\nMy order is never right and yet I still go...never again.  \\n\\nI officially deem this place the worst restaurant in Pittsburgh.","label":0},
	{"text":"Worst service.  Dirty.  Slow.  Ignorant by the strictest definition.  Do not go here.  Bad!  Real bad.","label":0},
	{"text":"Cigarette smoke and ashtray smells combined with mediocre coffee and subpar customer service are not my cup of tea, and I never even rank the tea here. Thank the Flying Spaghetti Monster that Biddle's Escape opened and now I have absolutely no reason to go to Katerbean.","label":0},
	{"text":"This place is now closed :-). Best thing that could've been done with it.  Going to opn in a couple of months under new management as the 61B caf\\u00e9. I look forward to seeing what some new life does to this place!","label":0},
	{"text":"I think triangle hoagies are great for parties and tailgates.  I normally order one or two battleships and all the fixings.  They are huge, they are reasonably prices, they are prepared quickly, and they are delicious!  I definitely will be back for more soon!","label":1},
	{"text":"I love hoagies, and this place has some of the best I've ever had!\\n\\nSaw them on a Rick Sebak doc and of course had to check it out. Totally lives up to the hype. A true gem in Swissvale.","label":1},
	{"text":"Great place for lunch. Excellent subs on amazing bread. Fresh, fast and healthy! \\n\\nBetter than any chain sub shop. \\n\\nHad the 6 inch torpedo. The battleship is huge!!!!!!! \\n\\nThey have an ATM inside and only take cash.","label":1},
	{"text":"Amazing! I prefer it over Vincent's, as long as it's veltre's in swissvale! and it's amazing!","label":1},
	{"text":"Pizza was fine but nothing special. The salad I ordered was wrong, though. And beware of the prices: What's on the website is wrong. And the manager and owner will say there's nothing they can do about that (except charge you the higher price that isn't on the website).","label":0},
	{"text":"This store is so gross that I was almost sick! Onions peeled and half-rotten. Squishy garlic. Dirt everywhere. I will NEVER step foot in this place again.","label":0},
	{"text":"I really don't get Giant Eagle. They are nice enough, but pricing just makes no sense at all to me. It is close to my house so I'll drop in to buy a thing or two, but would rather go just about anywhere else for my weekly shopping trip.","label":0},
	{"text":"I love that most of their employees make it known that they would rather be anywhere else but here. \\nThe prices are higher than most other competitors but it's the closest store to us so it's easy to get to.","label":0},
	{"text":"One of the worst Wendy's I've ever experienced.  Every morning there was a 30-minute wait - after ordering - for food.","label":0},
	{"text":"Please clean your floor properly.  It feels like Crisco under your feet.  Very dangerous.","label":0},
	{"text":"The atmosphere was fun. Our chef was very nice and entertaining. The filet was excellent.  Their salad dressing is a little harsh for my taste.  Over all it was a great time. I will definitely go back.","label":1},
	{"text":"The sushi during happy hour is great. The wife and I eat well for $20.  That's drinking pop though.  Don't judge.","label":1},
	{"text":"Love this place! Great sushi and have great sushi specials at lunch and HH. Bartenders are the best also. Marty is the man!","label":1},
	{"text":"Love their spicy black bean dip and their black bean and pineapple quesadilla... mmmm can't get enough of their black bean.","label":1},
	{"text":"You have no idea how badly I WANT to like this place. They are incredibly vegetarian/vegan-friendly. I just haven't been impressed by anything I've ordered there. Even the chips and salsa aren't terribly good. I do like the bar-- they have great sangria-- but that's about it.","label":0},
	{"text":"Always great service at the bar from Tanya and Nikki. Great food and wide selection of draft beers. One of my favorite spots.","label":1},
	{"text":"Small store but the customer service is fantastic . I deal with the manager and the ladies in customer service area on a weekly basis and all have gone out of there way to help me out .","label":1},
	{"text":"A very oddly laid out supermarket. the Deli isle is not very wide, the the walls are closing in on you, and they put the DIY olive cart in front to make it more cluttered. Just a poorly laid out store which is showing it's age.","label":0},
	{"text":"Dirty and small.  Not laid out well.  Expired items on the shelves.  Rude cashiers.  Self check out usually broken.  Horrible experience more than once.  I don't shop here unless I have to.","label":0},
	{"text":"GREAT Burger ! Loaded with Flavor, and ice cold beer. I normally do not visit chain eateries , but this place was close and very good for the money.\\nGood job guys !\\nOHHHHHHH , Did I mention FREE COOKIES ???? \\nNice Touch !","label":1},
	{"text":"Went there on my first day in Pittsburg. Wasn't the best experience. My waitress was to busy talking to her coworkers that she couldn't even give us any sauces. The food was ok but nothing to great. When I go back to Pittsburg I will not be going there again!!!!","label":0},
	{"text":"Not up to it's previous brunch standards. Buffet has scaled back in variety and quality.   Still good but no longer excellent.","label":0},
	{"text":"Absolutely horrible service, when we entered the hostess gave an audible sigh like we were inconveniencing her with our presence.  We were seated for over 10 minutes and never had a server come to even take drink orders.  Needless to say we left, and we will not be going back.","label":0},
	{"text":"Oh, I had fun here. They just need more portapottys. It's something to do and somewhere to people watch. And the fireworks were pretty.","label":1},
	{"text":"When trying to think of where to go for a steak dinner The Greentree Inn came to mind. I had never been here in all the years of living so very close. I was glad I chose this establishment. Food was excellent and I loved the feel of the place","label":1},
	{"text":"Service wasn't very good, and their (advertised) delivery was not available (because the delivery drivers car broke down). Maybe as a sit in it would be ok but I was not impressed","label":0},
	{"text":"Food is mediocre service is lousy. I'm sitting here right now and have been out of water and done eating for 20 min...","label":0},
	{"text":"I had the buffalo chicken pizza and really enjoyed it! Good quality cheese and chicken.. Hearty proportions.. No complaints !","label":1},
	{"text":"Great old-school donut shop with delicious donuts.  The even still tie up the boxes.","label":1},
	{"text":"Oy vey! Stay away, there's nothing here to see. Kmart, Phantom of the attic and a lottery place. This mall is dead! Deader than dead, dead dead!","label":0},
	{"text":"Easy access, plenty of parking, friendly staff, clean. A little old fashioned though but I think that's nothing to be bothered about if you just need a bed for a night. Glad they had an happy hour.","label":1},
	{"text":"The rooms are laid out weird, and for the cost the rooms are not worth it.  There are also not many place to eat around the hotel.","label":0},
	{"text":"Ten minute wait and easily most tables are open!!! Surprise it's lunch time!!!! I just passed six tables empty and clean. Beyond me...","label":0},
	{"text":"we checked out 4 rooms just to see what it was like, moldy ceilings,  musty smells, unclean rooms, and such a huge renovation job it should be shut down or discounted by 99%! thank god hotwire gave us a refund.","label":0},
	{"text":"Nightmare.  It's a ghost town. Needles in parking lot. \\\"\"Lobby\\\"\" is a hotel room with undesirables hanging around. Asked to see our rooms before checking in, given the key, room was filthy.  Saw a sticky note re: bedbugs.  Bolted, as fast as possible.","label":0},
	{"text":"Boston Markets are the same anywhere, but the people who work here are great. This is my favorite one!","label":1},
	{"text":"What a crock!   The thin bagel (with asparagus/mushrooms, swiss)...you get mostly cheese...it doesn't look at all like the picture on your website depicting a load of asparagus smothered in mushrooms...so full of it; definitely not worth the price. \\n(this was the one in Greentree)","label":0},
	{"text":"I stopped here yesterday morning because I was attending an off-site training session.  Typical Starbucks.  On the way back, I bought some of that new Starbucks VIA instant coffee to try at the office.  VIA does not taste like brewed coffee, so Starbucks loses one star for that.","label":0},
	{"text":"MARKET SQUARE.....The slowest, most inaccurate Starbucks that I've ever seen....how can you write an order on a cup and still get it wrong....I saw 3 wrong orders (including mine) in the 25 minutes that I spent waiting...I was 4th in a line of 10","label":0},
	{"text":"My stylist (Abbey) definitely knows how to do my hair exactly in the manner that I want. Everyone at MCN are really nice and friendly. It may be a bit pricey, but for a good haircut wouldn't you pay a good price too?","label":1},
	{"text":"Stopped in for lunch before a Bucs game. Great service and food.  Hamburger was thick and juicy cooked perfectly.  Service is excellent.  I can highly recommend SoHo as your pre Bucco stop.","label":1},
	{"text":"A nice selection of drinks (reasonably priced for Downtown Pittsburgh + next to a stadium) and the menu was easy to follow with plenty of variety. \\n\\nFood was well cooked and fresh ingredients - it was worth sitting outside!","label":1},
	{"text":"Spicy BLT was excellent! Jalape\\u00f1o Bacon and Basil Mayo...don't get me wrong, this isn't a high end establishment but that was a damn good sandwich. Friend with me was not impressed with the Filet Medallions on Bruschetta but the desserts were good and my BLT was GREAT!","label":1},
	{"text":"We we're not impressed. The prices are high for what is bar food with no real uptake.\\n\\nService was neutral both visits (stayed in attached hotel).\\n\\nWould be willing to grab a cocktail but definitely better options around.","label":0},
	{"text":"Bar next to stadium\\nTypical\\nbar next to stadium place\\nWaitresses def looking for other jobs \\nNot happy at all\\nThis isn't even a game night","label":0},
	{"text":"I love it here.  Great game day event location.  Great meeting.  Huge bar.  Huge selection.  Not just bar food.  So you will enjoy a dinner.   If you have the munchies it will hit the spot.   Ok do let's do it.  Have some fun.","label":1},
	{"text":"No redeeming qualities here. Schwill on tap. Food was terrible - had the pizza, mac & cheese bites, and spinach & artichoke dip.  It was hardly edible. Stay away.","label":0},
	{"text":"This place was a nice venue. The wait ayah was friendly and inciting and my food was tremendously delicious. I'd recommend it to anyone. Only complaint was the amount of time to be seated","label":1},
	{"text":"Came in for drinks after a conference and could not get service. Finally went searching for someone, who only came back with our order after we had nearly given up. And refills on water, coffee or soda? Forget about it.","label":0},
	{"text":"I went for lunch last week.  The food was awful.  Do not waste your money at this restaurant.","label":0},
	{"text":"One of the only places open downtown after 10 pm mid-week. Terrible service, average and overpriced food, in a hotel lobby, doesn't make a good combo.","label":0},
	{"text":"Had awesome service and pretty excellent sushi. They have these lettuce wraps which are to die for! Highly suggest them.","label":1},
	{"text":"In the lobby of the Westin. Service was friendly and exact. Good was excellent, especially since I thought it would be a mediocre \\\"\"hotel lunch\\\"\" at best. Scallops with potatoes and corn hash and some lovely mushrooms as well. Cajun shrimp butter was fantastic too!","label":1},
	{"text":"Not good. I suspect the servers are over worked or spread too thin b/c the service sucked. The food was ok, but nothing special. It's a shame b/c better service would have made the experience decent.","label":0},
	{"text":"The menu was small and underwhelming. The flatbread pizza most likely came out of the box. They didn't have the sauces, so the gave us ketchup to go with over cooked shrimp/bacon and extremely greasy fries.","label":0},
	{"text":"This is a gret place to go if you like Martini's!  The food is pretty good and the decor is awesome!  There are always some randoms bartending and you're never sure if you'll get a hipster or old mother Hubbard, but they always serve great drinks!","label":1},
	{"text":"Love the atmosphere and martini menu here. Nothing like a Frosted Grape martini and exposed brick to make you feel like a class act. I've also enjoyed any sandwich or salad I've ever gotten here. Highly recommeded!","label":1},
	{"text":"Sooo blacked out here that\\nWe heckled the guitarist.\\nNot sorry. He sucked.","label":1},
	{"text":"The cocktail menu options were mouth-watering. Great place to grab a drink with friends, especially on ladies' night out!","label":1},
	{"text":"My favorite bar in town love the live music and the martinis - fave is the strawberry shortcake!","label":1},
	{"text":"Food was good, had scallops, ahi tuna salad and chicken wings which were all tasty and at a good price. Drinks were the highlight, try my favorites of the night, jalape\\u00f1o Moscow mule and suit and tie.","label":1},
	{"text":"This place is good for drink before and after shows. I always wanted to try their food, but haven't yet. They have lots of different martinis. I will be back.","label":1},
	{"text":"This is my second time coming and I still love it and especially the Buffalo chicken spread! The atmosphere is a little dark for lunch time but over all it was a good experience.The service was also great.","label":1},
	{"text":"$3.00 fresh baked Italian loaf, need I say more.  The Italian bread is so yummy and makes great bruschetta.  They bake their bread fresh daily and do not include any preservative so eat it quick!","label":1},
	{"text":"Maybe it's nostalgia for the cigar but I thought he looked ridiculous. He bragged about a $4 pepperoni roll. There's a reason it cost that, because it wasn't very good. The sauce was disappointing. I wouldn't come here for anything.","label":0},
	{"text":"Fares keep going up. Another service cut this month. I think I'd rather walk to work in the middle of the night!","label":0},
	{"text":"Awful!!!\\nNever EVER follows schedule! Lets you wait for literally over an hour on a bus that is supposed to be running every 15 min.","label":0},
	{"text":"Been going Labad's since childhood.  Very nice guys - they act like they can be your uncles!\\n\\nThe place hasn't changed since the late 80s.  Excellent food and well stocked groceries.\\n\\nIf you have never been to the Penn Avenue district of Pittsburgh, you are doing yourself a great disservice.","label":1},
	{"text":"We made a trip to Pittsburgh a month back and a friend of mine insisted that we get a sandwich from Primanti's.  It was everything I'd hoped for.  I had a roast beef.  It was topped with slaw and fries and I threw a little hot sauce in there.\\n\\nWash it down with an Iron City.","label":1},
	{"text":"Hey a sandwich with the fries and slaw inside served on a wax paper sheet and tasty (maybe a little bland, may have not chosen the best type) but would go back in a second.","label":1},
	{"text":"The sandwiches here are massive.  Whatever you order winds up between two pieces of bread which seems both wrong and logical.  Regardless it is a mighty fine sandwich.  I wish I could get one right now...","label":1},
	{"text":"The food was just OK. Soggy french fries on a greasy cheese steak pattie.  The service was awful, noise, and not helpful for a newcomer to Primantis and Pittsburgh.","label":0},
	{"text":"Worst sandwich on Earth.\\nI'd rather eat a dead whore.\\nPlease...never come here.","label":0},
	{"text":"i love coming to pittsburgh solely for these sandwiches.  get a different one each time but they are to die for.  my new favorite is the capicola and egg.  i mean anything with fries and coleslaw on it can't be beat.  easily the best cole slaw i've ever had as well.","label":1},
	{"text":"As good as advertised.  The sandwiches are big with quality cuts of meat.  I thought the slaw was delicious too adding a little vinegary tang to the fries.  Great atmosphere and friendly wait staff,","label":1},
	{"text":"I'm with others here - not a lover of Primanti Bros.  Sandwiches are fine (I have ordered the turkey and cheese) but the service is horrible.  Rude, arrogant, and just nasty.  Plus when is the last time a broom has been taken to the floors?  (I'm reviewing the Monroeville one here).","label":0},
	{"text":"I am still trying to figure out how to transport a few sandwiches back on the plane.....There is just something about Pittsburgh and their traditional comfort food!  I have addicted my husband.","label":1},
	{"text":"eh.\\n\\nGo here once to say you did. You'll get a sandwich with soggy fries and coleslaw on it. It will be pretty huge. That is all.\\n\\nI might go back to check out the nightlife. I'll update my review then.","label":0},
	{"text":"The original place in the Strip District is the best by far. Capicola & Cheese is my fav and though I'm not a fan of cole slaw, the fact that it's a dry slaw does it for me.  Bring your appetite and leave your attitude at the door.","label":1},
	{"text":"Based on what I've read on yelp, I tried the Pastrami.  The cole slaw, fries, meat, and the italian bread all came together in a really HUGE sandwhich that was really good for a few reasons.  Flavor, texture, quantity, and presentation.  Ordered a couple of Yuenglings to wash it all down...not bad.","label":1},
	{"text":"Maybe the expectations were too high, but I had a pastrami sandwich and I thought it was quite bland. The only flavors were vinegar and pepper. It was better with hot sauce, but I expected better.","label":0},
	{"text":"Really bad service. Make sure to get in the face of the wait staff or count on being ignored","label":0},
	{"text":"Stopped at the Market Square Primanti's this weekend after a Pirates game.  Salami sandwich was out of this world, and the 24 oz. IC Light wasn't too shabby, either.  Great post-10pm food!","label":1},
	{"text":"I really don't know what the hype is about.  I was quite underwhelmed with this restaurant.","label":0},
	{"text":"ate at the one in North Versailles. floor filty, all young kids running the place, poor service, poorly made sandwich, very bad overall. The should have a manager on duty. I wont be back. thanks","label":0},
	{"text":"Underwhelming is one word that comes to mind. The meat tasted cheap, the fries were soggy and the sandwich as a whole was pretty tasteless.\\nMaybe my expectations were just too high, I don't know. I went bc I had to, but I definitely will skip next time I'm in town.","label":0},
	{"text":"There was basically no cheese on my \\\"\"cheese combo sandwich\\\"\", the fries were gross, and the waitress was nasty to us.","label":0},
	{"text":"Boring sandwich. Period. I fell for the \\\"\"hype\\\"\" and while it was filling for $7 bucks, it just did not satisfy a craving...I had the corned beef.","label":0},
	{"text":"At first I didn't like this place. I tried a few sandwiches and liked the Pittsburgh classic idea more than the actual food. I was about to give up when I tried the roast beef. It's my sandwich every time I go now. I'll be back.","label":1},
	{"text":"Good beer and food was really good but the service was mediocre at best. But I love that I can here the game and not random music by Rihanna","label":1},
	{"text":"Solid place for a Yuengling and a greasy sandwich. Try the Pittsburgher, a cheesesteak with a heaping helping of cole slaw and fries. A Pittsburgh institution, something that's worth checking out before leaving town.","label":1},
	{"text":"Disappointed, big time.\\n\\nLocal info lauds this place as an institution.\\n\\nI say: pass.  The sandwich was soggy, bland, and just all-around not good.\\n\\nI didn't get sick from it, so that's a bonus.  \\n\\nChoose wisely.  Go to Meat & Potatoes instead, and order a sandwich there.","label":0},
	{"text":"First time ever in Pittsburg and had to have Primanti Bros. Sandwich was awesome! (Cheesesteak) and a tall Yuengling to go with. Perfection!","label":1},
	{"text":"Returned to Pittsburgh, Ate at Primanti a 2nd time:\\n\\nI stand by my decision: Pass.","label":0},
	{"text":"Not sure that I could eat here more than once every 10 years, but I'll take my chances. I suppose it helps that my doctor's office is 2,500 miles away and the chances are slim that I'll run into him here.","label":1},
	{"text":"Bread, slaw, tomato, fries, and a small piece of overcooked fish all piled together. Warm yiengling and mediocre service.   Aweful","label":0},
	{"text":"Super friendly staff. Got there in the morning before the lunch rush. He sandwich is huge and delicious.","label":1},
	{"text":"In Pittsburgh visiting Carnegie Mellon U and was told we had to come here. I ordered the local famous burger. Can't remember the name but it was really good. The bartender was cool and the atmosphere was dope too. Cool place. I'd spend my money there again.","label":1},
	{"text":"Service sucked big time on Monday, June 9, at the Primanti's in Market Square. It took more than a half hour for my wife to get a cheese steak and the place wasn't even crowded. Missed the first inning of the Pirates game as a result. Boo!","label":0},
	{"text":"Highly disappointing. While sandwich is unique it was totally over cooked and under seasoned. No flavor","label":0},
	{"text":"I always try to hit this location when I'm in town. Great staff menu is solid & a Pittsburgh tradition.","label":1},
	{"text":"Great food overall at all locations! Go to another location to eat though. The Market Square location has the most horrible service I've ever experienced. Horrible!","label":0},
	{"text":"This is my go-to place after a Pirate game to wait out the traffic. When it isn't busy the service is great and you can get a quick, cheap bite to eat. Always great to sit outside as well.","label":1},
	{"text":"I was recommended here by a friend as a place to cross off the Pittsburgh \\\"\"bucket list\\\"\". I ended up getting the Pittsburger - it met my expectations, which was above average to begin with. I'd definitely come back here again.","label":1},
	{"text":"Good prices and a Pittsburgh Classic. Kolbassi sandwich with Fries? Yum. Spicy rub pickles? Yum. Good beer, too. Nice outside seating but beware the pigeons, sit-down and counter service,","label":1},
	{"text":"First Yelp review ever. Not impressed at all! 45% bread, 25% cole slaw, 25% fries, and 5% meat. The bread is cold and not grilled or warmed on the grill. Avoid and eat else where. Don't even think about the wings (dry and no flavor).","label":0},
	{"text":"I had the famous Pitts-Burger and it was disgusting! The only reason I'm giving it two stars is because of the bread. The bread is super soft and tasty but the meat was gross and the cole slaw was bitter. I don't see what the hype is all about!","label":0},
	{"text":"Well, now I know why people don't usually put french fries in their sandwiches. Sandwich comes out huge and kind of dry, and you can't taste the meat at all.","label":0},
	{"text":"Was in town on a baseball stadium tour and heard about this place from the locals.I enjoyed my sandwiches and was hooked with the special slaw added to the sandwiches.I was also in luck once we caught the pirates game I noticed they had primantis in the park so I ordered another sandwich.","label":1},
	{"text":"customer service is always nice but dont you all think that this place is little over-rated? Their 'Almost Famous Sandwitches' need some hard work to get famous. Basically, this place is like Dr. Pepper soda. People are crazy about it but that thing tastes extremely ridiculous.","label":0},
	{"text":"The sandwiches are giant, the atmosphere is good. I was there while the Steelers were on, so it was festive.\\nI agree they are a little dry...so get hot sauce, or ask for some mayo or ranch, ect...\\nAnd it was quite warm in there.","label":1},
	{"text":"I've tried it twice now because if you ever mention you're going to Pittsburgh the first thing you hear is \\\"\"Oh Man, you HAVE to go to Primanti's\\\"\".  Sorry, I guess it's just not my thing.  It's not horrible once I take off all the french fries they pile up, but it's definitely not my thing.","label":0},
	{"text":"Their tacos are alright but their groceries are kind of expensive. I've never seen a can of Goya brand beans priced at $1.50. I mean it seems like a little thing, but they couldn't have been more than $.89 a can in San Francisco, where everything else is totally unaffordable.","label":0},
	{"text":"Good: Mexican groceries in Pittsburgh\\nBetter: The chipotle tomatillo salsa, homemade by Edgar.\\nBest. The taco stand.  Seriously, if you're here, get a damn taco.","label":1},
	{"text":"Being from LA, I was disappointed with the tacos. The Carne Asada was bland and didn't think this is authentic Mexican food but another street faire.","label":0},
	{"text":"The stand outside (edgars), chicken taco with everything on it, best ever.","label":1},
	{"text":"Awesome food! Im from LA, so id like to think I know a thing or two about mexican food and I can honestly say this place is a homerun! Great salsa, fresh tortilla chips, friendly owners and staff.","label":1},
	{"text":"As others have said, nice location and sitting on the patio is nice in the warm sunny months, but the food is not anything special.  Fried seafood, decent lobster roll, other non-impressive dishes.  good for a few drinks and a quick bite if in the area.","label":0},
	{"text":"this place reeks of fish when you walk in and there are fruit flies everywhere.  Good place to dine if you're on a diet since you will surely lose your appetite.\\n\\nIf you find yourself at Rolands, do yourself a favor and leave and dine anywhere else in the Strip District.  Seriously.","label":0},
	{"text":"we went three for st, patrick day. Two harps bottle beers and 12 oyster costs $40.","label":0},
	{"text":"Lobster roll was awesome.  There was a Moosehead beer cap in our fries and the waitress' response was, \\\"\"That must be from the beer batter.  I will give them hell.\\\"\"   I wasn't looking for a free meal but an apology from someone would have been appropriate.","label":0},
	{"text":"Lunch on a Wednesday with 4 people. Lobster rolls= excellent!  Crab cake sandwich= excellent!  Yummy, warm fries! Very good service and warm food!  Was worried when we saw poor rating on Yelp. Very happy and will come back!","label":1},
	{"text":"I really wanted to like this place. The beer choices and the casual menu was right up my alley. Unfortunately the food was not. The \\\"\"famous\\\"\" lobster roll had so much butter on it I think I am going to have a heart attack in my sleep tonight. Can't recommend the place.","label":0},
	{"text":"One of the best places to buy coffee in the city. The Raspberry Truffle Latte is my personal favorite, but be sure to try their other speciality drinks that they post. Great location (Market Square), great environment and atmosphere, and friendly and helpful staff. Get a cuppa!","label":1},
	{"text":"Just bought a latte and child's hot chocolate, and both were good and the smell of the place is awesome... I coffee beans!","label":1},
	{"text":"Great coffee and Tea selection.  Good prices for latte's, cappuccino, ect...","label":1},
	{"text":"Wide variety on coffee & teas - even cigars. Relaxed atmosphere & friendly people.  Lots of flavored coffees, though I'm not a huge fan flavored coffees.","label":1},
	{"text":"I'd heard good reviews, so I stopped in last time I was downtown, but I'm not impressed by their coffee. Dark roasted, bitter, etc. If I'm looking for coffee downtown, I'd go find that 21st St. Coffee branch instead. Still, they sell a bunch of other neat snacks and stuff, and it beats a chain.","label":0},
	{"text":"The owner, Nicholas G Nicholas needs to attend a few driving classes before he kills someone. Maybe too much hp for him. If you see an 08 white porsche with FL plate 917 MNC stay clear. Guy drives like a nut. Almost ran me off the road in Boca Raton by 95.","label":0},
	{"text":"I go here almost weekly. You can get a huge grilled chicken salad with bread and tzatiki for $6.25. Absolutely worth it for the money.","label":1},
	{"text":"The food can be somewhat disappointing but will sometimes do in a pinch.  The service is quick and the prices are reasonable for Downtown.  They are open late hours, so sometimes that can be handy.  There are better places for Greek food, but Salonika's is often close by.","label":0},
	{"text":"I like their gyro salad. It tastes very good with the pita bread. Good portion. I don't get hungry later afternoon.","label":1},
	{"text":"Just got a small, pre-made chicken salad sandwich and a cup of chicken chili from the Fifth Avenue store, and paid over $9. You can get much better quality and value elsewhere in Pittsburgh.","label":0},
	{"text":"This place looked hopeful for authentic Mediterranean but the food just didn't live up to any expecation. Do yourself a favor and go next door to Cafe Milano.","label":0},
	{"text":"Light Up Night.  Food has good flavor but doesn't look so hot.  If I hear about the Jackie O desert one more time I'm gonna barf.","label":0},
	{"text":"Excellent everything! Classic family-run Greek restaurant. Home made everything, including great family-made Greek wine. Inexpensive and authentic. Christos, the owner is hospitable and welcoming. I come from NYC, and I say this is right on par with the Greek food back home.","label":1},
	{"text":"Magic happens at this restaurant. Beautiful family, beautiful service, wonderful food (and wine).\\n\\nWe love you Monica!!!!\\nLove always, your friends in CA","label":1},
	{"text":"Fettucini from a can, anyone? \\n\\nIf you like paying $10 for tasteless pasta and sauces, this is your place!\\n\\nStay away and never look back.","label":0},
	{"text":"great place to just look around, but they serve food too. i saw the other reviews and they didnt like it. hmmmm. i loved their food. 2 can dine for 25 bucks and itss good.","label":1},
	{"text":"Spag Warehouse is the best value for money in the tri-state area.... damn good food!!","label":1},
	{"text":"Service is lacking and food is mediocre. When I crave Italian this is not the first place I think of.","label":0},
	{"text":"Didn't think this was possible, but it's worse than Olive Garden...food was horrible and extremely overpriced, service was decidedly lacking....  Neat location with fun and interesting decor but I wouldn't eat there again.","label":0},
	{"text":"A long long time ago in a far away place, I used to go to a place called Spaghetti Warehouse that was cool, clean, had good service, and had really good food. But that place is gone and now I'm left at this place that is dirty, has horrible service, and mediocre food. The end. Never coming back.","label":0},
	{"text":"Took two and a half hours to get our food. All our food was the thrown together in the same pan. Not worth the $55.","label":0},
	{"text":"love their drinks and they have good food. the staff is friendly and take out is prepared correctly and quickly. Costco has gift cards that cost less than the face value so you can really get more bang for your buck!","label":1},
	{"text":"Ewww, the food here is terrible.  Nothing I had tasted good.  It tasted like it had been sitting under the food warmers for hours.  The service is luke warm at best.  Just skip it.  There's so many other places out there for good italian food.","label":0},
	{"text":"The food is awesome. Nice atmosphere. Come in on happy-hour that you can get oysters for $2 and colossal shrimps for $2.25 at the bar. They are a must-try.","label":1},
	{"text":"I ordered the center-cut ribeye for entree. It was delicious. \\nThe environment is nice and servers are polite. Recommended.","label":1},
	{"text":"Fair well old friend. You will be greatly missed. After being in downtown Pittsburgh for 60 years, Saks Fifth Avenue is now closed. :(","label":1},
	{"text":"Charming store with high quality items.  I've purchased business cards and placesetting cards. The staff was very attentive and detail oriented. Great customer service.","label":1},
	{"text":"Calzones are excellent. Highly recommended, very filling and cheap. Pizza is good but not great. Can't beat the price in downtown Pittsburgh, 16 inch for $10.50. Been here four times in two weeks","label":1},
	{"text":"Not worth your money.  Poor service, worn interior, A/C was non-functional, THE CD PLAYER DIDN'T WORK, AND THERE WAS NO AUXILIARY JACK.\\n\\nThey get two start because they managed to get us from Point A to Point B without making us fear for our lives.","label":0},
	{"text":"You just gotta have a Peppi's hoagie...especially on your way to a Steelers game.  The guy stands under the bridge near Reedsdale shouting, \\\"\"Peppi's.....hoagies....\\\"\"  They are damn good.  Talk it into the stadium and enjoy :)","label":1},
	{"text":"Best Espresso Hands down. Makes me want to hop on a plane and come home for a weekend just to wake up on a Sunday and hear italian men next to me while I sip my espresso machiatto.","label":1},
	{"text":"The best place for coffee!!! I love everything about this place.. The atmosphere, the neighborhood feel, the baristas, and the patrons (especially the little Italian men sitting outside playing cards drink espressos). A huge favorite place in my book!!!","label":1},
	{"text":"La Prima is an excellent, no nonsense coffee shop.  It gets very crowded on Saturdays, but I always try to stop in for a double espresso.  You're not going to want to bring your computer.","label":1},
	{"text":"Oh how sad. \\n\\nFull of younger kids who don't really know that gay doesn't need to be synonymous with slutty or bitchy. \\n\\nBig dance floor area, and a bar quartered off by a chain link fence (for real). Sigh. \\n\\nKind of what you don't want a gay bar to be.","label":0},
	{"text":"Basically, if you don't need a fake ID to get in/aren't interested in pedophilia ... don't bother.","label":0},
	{"text":"Excellent casual business lunches - salads, sandwiches - always freshly prepared and consistent quality.  Family owned.","label":1},
	{"text":"The only Chinese supermarket in Pittsburgh. Thank goodness it's well stocked. Unfortunately it's a 30 minute bus ride from school and hauling the goods back is not easy. I feel most at home here, it even smells Asian!","label":1},
	{"text":"Best Asian grocery in Pittsburgh. Went shopping for ingredients for a Korean dish I was making and they had everything. Food is fresh also!","label":1},
	{"text":"If I can give haft a star I would. Never shop at this Asian grocery since Many more open. Owner and employee alike no manners and nasty. Sorry guys it's the truth.","label":0},
	{"text":"Love this store! It absolutely stinks, but the prices and the foods you find here you won't be able to find anywhere else. Has the best sweet chili sauce. Beware though, rarely anything has english labels on it.","label":1},
	{"text":"I needed a sweater rewoven and Lulu did an awesome job.  She was apologetic about being backed up wtih work, but I wasn't in a hurry. Pricing is very reasonable and she is very competent with her work.  I would highly recommend this business.","label":1},
	{"text":"Food was only just ok and service was even worse.\\n\\nThere's plenty of other places you can go to for breakfast  - even Eat'N'Park would be better but hit up a place like Ritter's instead.","label":0},
	{"text":"J'adore this store!!!  So beautiful and filled with many inspiration pieces. Very much on the pricey side, but a check online shows me that their stock is not too overpriced. This is def a room in heaven. :)","label":1},
	{"text":"I love  Andy and he loves me. \\n\\nI used to come here every Sunday after church and order his special not on the menu rolls. Those are awesome.  They are really fresh and flavorful.","label":1},
	{"text":"I want to like it.  But ultimately, it took forever to get and he doused my sushi with various sauces that were NOT listed on the menu.  As a condiment-o-phobic, my sushi was ruined and I didn't feel comfortable enough to request it be fixed.  \\n\\n15$ later, I tossed it and walked out, miserable.","label":0},
	{"text":"I'm sorry, but as cool as Andy is, I just don't like the sushi.  The tuna tasted metallic and mealy, definitely not fresh.  I actually spit it out in my napkin upon first bite.  The portions are large, yes, and the prices are good, but I'd rather pay a little more for sushi that is less suspect.","label":0},
	{"text":"Andy is super entertaining, and serves up the best sushi in the burg!  Don't miss!","label":1},
	{"text":"As of July 25, 2014, a sign on the front said that it was closed permanently.","label":0},
	{"text":"Absolutely the worst sushi my husband and I have ever had.  It was Gross!!! I don't know why they use so much rice or why the fish wasn't cold.  You couldn't pay me to go back to this place!","label":0},
	{"text":"Staff are friendly. Sushi is not overpriced although the rolls could be made better. Otherwise this is a decent sushi place for a lunch once in a while.","label":0},
	{"text":"I had a lunch there once. The food is ok but it's on the pricy side. I don't think I will be back.","label":0},
	{"text":"Completely chill environment. I pretty much always get the chicken quesadilla which is awesome, so I really can't comment on anything else. The prices are good and the service is quick.","label":1},
	{"text":"A friend recommended this to me, and I can't figure out why.  The food was underwhelming and pricey.  The service was fine, and the place looked nice, but I can barely remember what I ate there it was so forgettable.","label":0},
	{"text":"Fairly average Italian food other than the meatballs. Too many good Italian places in Pittsburgh to choose here. Interior could use an update. Beer selection below average and nothing special happening with speciality drinks.","label":0},
	{"text":"The food quality doesn't match the place at all. I think it's ok for a pub but this place is supposed to be a nice place for professional lunches. \\nI had the chicken flatbread and the chicken was more like subway chicken! \\nWith so many options around that area I won't pick this place for lunch.","label":0},
	{"text":"Located downtown, call Dr. Greg and he can get you in that day, sometimes within the hour.  He's a cool guy, very friendly, and not a new-age, hippy, sales-y doctor like some of the other chiropractors that I've been to.  Accepts insurance & FSA...if you work downtown, I recommend him.","label":1},
	{"text":"Dr Greg is great! Staff is very friendly as well. HIGHLY recommend them to you if you work in the downtown pgh area","label":1},
	{"text":"ZERO Stars.  Today, my friend in a wheelchair came in and his friends wanted to sit at the bar for a slice.  They asked if there was an exception to the rule about being at the bar.  The manager told my friend that he could not be accommodated.  That's illegal and immoral and absolutely disgusting.","label":0},
	{"text":"Update time:  How easy is it to win me back?  Remind me how good your hoagies are, that they're not overpriced like the Pizza is, and then serve me endless glasses of Coke Zero.  That's how!  Villa has regained a fan in me...good hoagies and Coke Zero...SWEET!","label":1},
	{"text":"Meh - it's not that there was anything bad about the pizza, it just didn't blow me away or anything.  Good for a quick lunch at the counter.","label":0},
	{"text":"The salon is so dirty we left before I let them cut me hair. The sanitizers were old and half full. The scissors and combs were a mess.  http://www.wellbuzz.com/dr-oz-beauty/dr-oz-pedicure-bacterial-infections-dry-pedicure-haircut-ringworm/","label":0},
	{"text":"I took my parents here because it's one of their favorite places, but I wasn't that impressed.  The service was impeccable, but the food - not much different than Outback or Texas Roadhouse.","label":0},
	{"text":"Best Steaks in Pittsburgh!!! I come here a lot for special occasions.  It is a pricy place but it is worth every penny. I had a New York Strip and it was really tender and juicy.  Definitely one of my favorite restaurants.  The service is excellent also.","label":1},
	{"text":"Hostess: 1.0\\nBartender/ waiter: 2\\nFood: 3\\nProperty: style decor ambiance: 2\\n\\nWhen did they start storing their stuffed olives in Styrofoam cups?","label":0},
	{"text":"Employees were all working hard very nice and conversational.  My family and I enjoyed celebrating my birthday here over the weekend","label":1},
	{"text":"I have eaten at a lot of Ruth's Chris joints.  This was the only place where nothing tasted like any of them.  Apparently not part of the main chain and it shows.   Fail on all levels.  Had to send steak back twice before I just said to hell with it.  Horrible.","label":0},
	{"text":"Needed the heel on my work shoe repaired. I walked in and they fixed it right there and then. Quick and sufficient! Definitely recommend this place to the locals.","label":1},
	{"text":"I brought my boots here to get fixed. They did a good job however the lady was extremely rude when I came to pick them up. I won't be going here again.","label":0},
	{"text":"Really good quality old school Italian in the downtown business district. \\n\\nGreat service, good selection and some great specials.","label":1},
	{"text":"Food was okay, but was very surprised that they have absolutely no handicapped accessibility. Steps to get in from the street, restrooms up the stairs to 2nd floor. No accessible stalls in restrooms. Surprising in this day.  NOT HANDICAPPED ACCESSIBLE.","label":0},
	{"text":"There's nothing about this specific location that is bad.  It's the Einstein Bagels food itself.  I got a Santa Fe Egg wrap, and I don't understand how they can use the term \\\"\"egg\\\"\" in the name.  There's no way in hell that slimy yellow gelatin came from a chicken!   Absolutely horrible.","label":0},
	{"text":"Stan's has great prices OUTSIDE mostly because they things they have prepacked are spoiled and moldy or will be tomorrow.  Inside is just average quality, equally average priced produce.","label":0},
	{"text":"The price and freshness of the produce here is on par with most of the other vendors in the strip district. I'd recommend stopping by here to see which groceries are being discounted; those tend to be a good bargain.","label":1},
	{"text":"Just got back from a trip to the Burgh and of course Klavon's!!!\\nStill AWESOME!!!","label":1},
	{"text":"This place gets a 4 star based on the decor itself. There is nothing like a classic ice cream parlor setting to take you back and provide its own unique experience. The ice cream is nothing special but its the booths and the menus and the pretty decor that really got me.","label":1},
	{"text":"Just found this gem.  This is a great place for every ice cream lover.  Great place to hang out with friends or to go on a date.\\n\\nI recommend the sundaes at this place.  This is pure 50's and 60's style that isn't forced.  Staff are very friendly and patient.","label":1},
	{"text":"Do no stay here if you plan to sleep before 2:30 AM. They could not care less that there is a very loud bar directly across the street. If loudness doesn't bother you than this place is fine.","label":0},
	{"text":"This courtyard has had the renovation treatment that most are getting around the country. Not every room has a mini fridge yet but they can bring you one if you request. I had a room looking into the courtyard which is nice for sound but weird for having the blinds closed for privacy.","label":1},
	{"text":"Great deli.  Had a very good Ruben today.  Great food and friendly service.   I'll definitely be eating here again.","label":1},
	{"text":"Pastrami sandwich(hot) was great. Tender and plenty of flavor. The only thing I didn't care for was the $14.50 for the sandwich, can of soda, and bag of chips.","label":1},
	{"text":"Saw Phantom when it came through. Grew up seeing Nutcracker every year. JC Superstar was awesome. Beautiful place and Pittsburgh is soooo lucky to have it!","label":1},
	{"text":"Great theater !!! Absolutely beautiful .. Live the seating ... Seen Book of Mormon here !!! Loved it","label":1},
	{"text":"I have seen several shows here over the years. Most recently, I saw wicked, which was amazing!!! The one thing I really have to applaud about the Benedum is that the seats are all pretty good. I am on the shorter side and have never had trouble seeing, no matter where I was seated.","label":1},
	{"text":"A good bar with OK food.  \\n\\nFairly diverse menu, so you dont have to have a burger, etc.","label":1},
	{"text":"I have only one thing to say... Garbage Burger. Max and Erma fans know exactly what I'm talking about. When in the burgh go to Max and Erma's for a garbage burger!","label":1},
	{"text":"Incredibly slow, worst club I've ever had...hilite was the tortilla soup. That was actually edible. Waiting 40 minutes for a cold club and cup of soup is totally unacceptable. Especially when we were the 2nd table seated of the day.","label":0},
	{"text":"1.5 stars.  I agree with Eszter, this deserves 2 stars only because of the service.  A sad little \\\"\"Chinese\\\"\" buffet with a smattering of overcooked options.  Soups were borderline offensive.  There probably won't be a wait!","label":0},
	{"text":"I can't tell you how bad this place is, regretted not looking up on yelp for reviews before ordering for delivery.\\n\\nSeriously this place has the worst Chinese food I've had in my whole life!!!!!!!!!!","label":0},
	{"text":"This is the worst Chinese food I've had. Ever. And Pittsburgh has some pretty bad Chinese places.  The Golden Palace buffet is bad, but at least edible.  I am utterly baffled at how this place stays in business.","label":0},
	{"text":"This is always one of my favorite stops when visiting the Strip. A wide variety of party favors and Pittsburgh paraphernalia.","label":1},
	{"text":"I don't understand why this place think's it has famous Corned Beef. I can only believe it's because there are no other deli's downtown.  The restaurant/bar is a dive.  The Corned Beef is nothing great and their side dishes are nothing special.  Not worth the trip.","label":0},
	{"text":"Rules made by men. Check them before you book this church to get married or any other event. Their restrictions are far beyond respect and more on the ridiculous side. Stay away from this church.","label":0},
	{"text":"It took over two hours for our lunch here and it wasn't even busy.  When the food finally came it was bad.  We never received an apology.  The prices are cheap, but it's not worth it.","label":0},
	{"text":"Mahoney's is the type of place where women are accosted by the bartender as my girlfriend was this evening. Don't go!","label":0},
	{"text":"no. no. no.  $5 credit card minimum.  no bathrooms . . . and you sell coffee? good brew but why bother having tables if you don't have a place for customers to go?","label":0},
	{"text":"Not the friendliest customer service.  Prices okay.  Look for deals on their website.","label":1},
	{"text":"Did not enjoy my meal what so ever.The staff was cold and the seating area was dirty. The place was more of a hole in the wall then I can appreciate. Cheap but your getting what you pay for in quality.","label":0},
	{"text":"I stop here every time I am in the Strip.  Authentic Greek grocery.  Do not pass up their stuffed grape leaves or the freshly made Babaganous & hummus.  They have great cheeses and a variety of dried lentils and spices.  You will find something delicious here, I promise you that.","label":1},
	{"text":"Do not use this dry cleaner. The staff/owner smokes in the store. There are ash trays and packs of cigarettes lying around. I had to \\\"\"air out\\\"\" my clothes after I picked them up from Galardi's to try to get rid of the cigarette smell. YUK!","label":0},
	{"text":"They lost my clothes and charged me for stuff I never sent.\\n\\nClearly they do not know what they are doing and need to get their act together!!","label":0},
	{"text":"Not only did they damage a sweater, they told me they would take care of it with my tailor and never did.  On top of that, they write in PERMANENT MARKER on your clothes! Unbelievable! Stay away from this place.  Take the time and take your clothes somewhere else.","label":0},
	{"text":"I love your wonderful cheese, Penn Mac!  You have an amazing variety, all my favorites.","label":1},
	{"text":"The restrooms looked like after an bombardment, an improvised shack amid buckets of olives and spices. Highly questionable hygiene for a food store!Disgusting. I will not go back until they clean up the place. It's just filthy!!!","label":0},
	{"text":"I love it here :)  I love all the employees and the owners also!  I miss Penn Mac now that I live in Hawaii but I will visit every time I am in Pittsburgh!","label":1},
	{"text":"I saw Franco Harris at this place he was a class act great place to by real food from Italy","label":1},
	{"text":"Nothing better then the strip district in Pittsburgh. It's every Italians dream. The PMC is the best has a little bit of everything. Fresh bread great pasta and Olive for days. I love it here and the smell is terrific :)","label":1},
	{"text":"Our in-laws suggested Dr. Battle and company when our dog, Levi, suddenly got ill.  The staff was very kind and caring even when the diagnosis was not positive.  They gave us as much time as we needed to stay with Levi and were sympathetic.","label":1},
	{"text":"This place rocks! The coffee selection is out of this world and the coffee itself is wonderful! It is smooth and just terrific!","label":1},
	{"text":"They have an extensive assortment of coffee beans and a friendly, quick staff. I wound up getting their Sumatra beans and loved them.","label":1},
	{"text":"Very good.  Great atmosphere for a date or special occasion.  The Pasta trio is always great.  On Sunday they offer family style for $25(Salad, Entree, Dessert).  \\n\\nGrilled Octopus, Lasagna, salads are very good.  Will be going back soon.","label":1},
	{"text":"as a big fan of Lidia's, i was anxious to eat at her restaurant, and it was totally awesome. would highly recommend.  Food was excellent. wait staff was attentive. we arrived early for our reservation and they were able to seat us.  it was a lot of fun and the decor was awesome too.","label":1},
	{"text":"The NY restaurant is much better.  We were eating here often, but it got boring quickly. The staff are great and the location is good for people who drive into Pittsburgh. I'd like to see some the dishes that make the NY restaurant great.","label":0},
	{"text":"Not a place I'd return to for regular fare, overpriced for quality.  But the brunch is a divine value.","label":1},
	{"text":"Lidia's is a good restaurant for Italy food.  Though there is little bit loud, food here are really awesome. \\n$6 is needed for valet.","label":1},
	{"text":"I'm not sure why people like this place so much.  The wait was long, the food came out cold, and the pastas were overcooked, gluey, greasy messes. The service was friendly but the food was very poor. Will never go back.","label":0},
	{"text":"I've had some excellent meals here when there were 3 or 4 of us.  I've had two group functions that were  way less than wonderful. I would not entertain having an event for any more than 4 people.  Even 10 people taxed the staff!","label":0},
	{"text":"Great food and service, very pleased with my Valentine's day dinner here.  Planning to come back to try more of their fare, since their Valentine's day menu was limited.","label":1},
	{"text":"What an embarrassment. Rotten/black  salad greens. A server with a black eye. Pedestrian \\\"\"signature\\\"\" pasta. Plates and glasses left uncleared. Greasy, scratchy plates at buffet. All yours for $28 per person!","label":0},
	{"text":"Classy Wonderful establishment. Visited for my mother's 60th birthday.   She was astonished. For that very reason,  I love this place. The food was great the servicew was excellent.  Kudos to Waiter Cheno!!!  Well definitely visit again.","label":1},
	{"text":"I've been here for a brunch which I really enjoyed. You just helped yourself to a buffet. It was of course scrumptious! Don't remember exactly what I had but remember it was good!","label":1},
	{"text":"Have always had superior meals here. Wine selection is good. Service is always top-notch.","label":1},
	{"text":"I had really high expectations for this place but the food was overpriced & bland my lasagna tasted like it was made by Stouffers. The service was excellent the food nothing great.","label":0},
	{"text":"Traditional pizza is awesome. Delivery is very fast as well. They always tell me 40 minutes and then arrive in 15-20.","label":1},
	{"text":"The Moroccan Spiced Chicken and Dry Plum pizza is an exotic treat! I also liked their cinnamon sticks to death! Very good. I can't believe they delivered to us all the way from downtown in such short time. Awesome pizza joint.","label":1},
	{"text":"When you are there order the Ephesus Pizza. It is their signature pizza, cant go wrong. Has many recipes on it; vegetables, chicken or pork shish kabobs(yes,heard me right, shish kabobs on a pizza), honestly one of the best pizzas I have ever eaten.","label":1},
	{"text":"This is the best pizza I have found in Pittsburgh so far. It makes me sad that it has taken me four years of tasting quite mediocre pizza before finding this gem. So far my favorite is the steak pizza, however, it is all delicious.","label":1},
	{"text":"Too oily , i felt like im eating pure fat , even the bread is covered with oil ! I suggest they make it healthier with more whole wheat option, grape leaves are very dry and tasteless. Oh and their fries are terrible","label":0},
	{"text":"Beautiful old building, five minute walk to PNC park.  Our visit was to see the Phillies and get a taste of Pittsburgh.  Great view of PNC Park from our room.  I felt the hotel and service were first class, yet the place was not stuffy at all.  We will definitely be back!","label":1},
	{"text":"Great location - make sure you ask for a view of the river.  Worth the money.","label":1},
	{"text":"Beautiful spot for a wedding. Very clean, the food was amazing (not your average wedding fare) and a breathtaking view of the city.  I cannot imagine a more beautiful hotel venue for a wedding.","label":1},
	{"text":"Good food worth waiting, and waiting, and waiting for...  Now wait & wait for the check.","label":0},
	{"text":"Lori was working at the front desk the evening we checked in (7/24/14).  She was fabulous!  Thanks for the help, Lori.\\n\\nBeautiful place, great Wi-Fi.\\n\\nErin","label":1},
	{"text":"Great environment great location with easy parking and access to Downtown Pittsburgh.","label":1},
	{"text":"I love the Convention Center.  I go to the car shows every year here, and they always put together a great program no matter what it is.  It is a great venue with a ton of room.  Not to mention, they have little concession stands set up that serve up some delicious food that will keep you satisfied.","label":1},
	{"text":"The hotel is kept clean and the room rates were very good.  The service from the staff was excellent.  Interestingly enough the restaurant in the hotel has the best sushi in Pittsburgh.","label":1},
	{"text":"Nice hotel.  Check-in was extremely smooth and quick.  Hotel is very clean.  Room is nice.  Shower drain kind of sucks but I can deal with that.","label":1},
	{"text":"Beautiful rooms, excellent meeting spaces. The beds are like clouds and the double shower head in the bathroom was amazing. \\n\\nHowever, the customer service lacks excellence and the WiFi is completely unreliable.","label":0},
	{"text":"Marginal at best for the money. The whole place really does not seem up to the standard of other Westin properties I have stayed at.","label":0},
	{"text":"Conveniently located next to the Convention and Conference Center in the heart of downtown. Great furnishing and modern up-to-date amenities one would expect at a Westin property. Big full head rainfall shower and comfy pillow and mattresses to relax after a long day","label":1},
	{"text":"Valet lost my car keys and have been incredibly unprofessional! Completely unacceptable and I would warn everyone about using valet services here. Disgusted.","label":0},
	{"text":"Horrible, go to Long John Silver's. I hear oyster bar and think delicious raw oysters not deep fried crap .","label":0},
	{"text":"Everything about this place seems very antiquated.  I wasn't impressed with my clam chowder.  There was some kind of bread component inside the clam chowder that may have been an attempt at dumplings but just tasted like soggy bread.  \\n\\nI'm not a fan","label":0},
	{"text":"This restaurant is horrible.  The waitress was rude and tried to rush us.  The only oyster on the menu is a terrible patty of some kind.  How can you call yourself an Oyster House and not serve either fried oysters or raw???  The food overall was ok.  I would never go or eat there again!","label":0},
	{"text":"Only has 1 person working and serving the restaurant. Took 15 minutes to be asked if I wanted a drink, another 15 minutes to get a menu after asking for one. Annoying wait, they need to hire more people","label":0},
	{"text":"Oyster shooters in a plastic cup. Looked a little dirty. Shooters just tasted like ketchup.","label":0},
	{"text":"Average pizza. But with ten guys working - and not much business at the moment - it still took twenty minutes to get a slice of pepperoni. I'll walk across the street next time.","label":0},
	{"text":"Hubby and I dropped in after a hellish morning at the Social Security office. Hubby loves pizza so we made a stop.\\n\\nPizza wan't bad, it was actually pretty decent. But the place was disgusting and the cashier was incredibly rude.","label":0},
	{"text":"Good for a fast lunch. Had the gyro and added feta. Gyro was fine. Bottle of coke had icy slush in it.","label":0},
	{"text":"Friendly service, good food and cozy atmosphere. Open late so best place to stop by and get some delicious snacks. 20\\\"\" hoagie is the bomb:)","label":1},
	{"text":"Update - went back another time and the pizza was mediocre at best.  So disappointing, we loved it the first time!  My guess is that if you get pizza right out of the oven you're good to go - otherwise, you're SOL.","label":0},
	{"text":"Zero stars. Came in 10 mins before close. Female manager on duty asked for $100 in exchange for a pizza. When we refused she said she could not serve us because her employees had been working since 9am..,it is currently 2:00 am... Sounds pretty illegal to me","label":0},
	{"text":"Pizza is delicious chicken ranchero is one of the best pizzas i have ever had and they have a deal where u get xl specialty pizza with free sub or wings deff a must try","label":1},
	{"text":"Horrible staff! Terrible attitude and we could tell didn't want to be there.  Screwed up our bill and was visible aggravated and angry when we questioned charges.  This awful service makes us never want to return.","label":0},
	{"text":"For the first time in my life, I sent my meal back to the kitchen. The Corn Beef in the Corn Beef and Cabbage tasted really bad and felt like I was chewing gum. Avoid that plate at all costs","label":0},
	{"text":"I love this store. It is always busy and it is kinda ghetto but on a positive note the layout of the store is pretty ok because I still find amazing deals.:)","label":1},
	{"text":"This place does decent Thai food, but is nothing special. There was nothing memorable or notable about my meal. The service was decent. This is one of few places in downtown Pittsburgh where a vegan can go and be reasonably accommodated.","label":0},
	{"text":"Waiter was awful and food (pad thai) was not much better. Apparently letting the waiter know that your soda is flat (twice) is a huge inconvenience to him.","label":0},
	{"text":"Just had the panang tofu for lunch, and was crazy underwhelmed.  Tiny portion, very watery sauce, and just no *zing* at all to the flavor.  The wait staff was slammed by a half-full restaurant, so things like a coke took ten or fifteen minutes.\\n\\nThis trip was bad, even for the price.","label":0},
	{"text":"Poor service, awful attitudes and sub-par food.  I could make the same food in my own kitchen ... Hope to see another Thai spot open downtown.","label":0},
	{"text":"Oh this place needs Gordon Ramsay, Friendly staff, but something is missing I don't know what? \\n\\nFood was ok, but not fab. I was a little disappointed with the Panang curry which didn't look like what I know it should look or tasted like. \\n\\nThai tea was no bueno.","label":0},
	{"text":"Don't waste your time or money. Rude service, and pizza was subpar.  So many better options right around. Please dont cut corners on quality of your product.   The bar looked small and quaint. ..maybe the beer is really cold or I just hit a bad day.  For pizza? Na ...won't be back! NEXT!!!","label":0},
	{"text":"This Starbucks is worthy of mention only because it moved into the lobby of the former Plaza Theater.  The Plaza is where my friends and I (legally) first saw R-rated movies on our own.  I remember seeing \\\"\"Pulp Fiction\\\"\" here.\\n\\nOtherwise, it's just a Starbucks.","label":0},
	{"text":"Every time I have been to Cafe Sam I have been very disappointed.  On my most recent visit, the waiter was overbearing, the menu confusing, and the food unremarkable.  Avoid this place.","label":0},
	{"text":"Cafe Sam has a cool Pittsburgh vibe. It's a bit funky but the food is good and interesting and their menu offers a lot of choices. I went with a group and we all had the Prix Fixe menu. It was a little bit pricey, but I think it was well worth it.","label":1},
	{"text":"Great experience. Staff was quite attentive and seemed to genuinely care about our experience. Allowed us to sample a couple appetizers. Most of the items we had for dinner (appetizers, entrees and dessert)","label":1},
	{"text":"One of the great independent record stores, Karl Hendricks runs his business just like he plays: with passion and creativity.","label":1},
	{"text":"I was skeptical about going to a typical pizza shop during a food tour in Bloomfield, but boy was I wrong. This pizza is really good and you can tell that they do not pick the cheap ingredients off of the shelf. The dough was perfect (cooked well, but kinda doughy) and the cheese was excellent.","label":1},
	{"text":"The large pizza is huge. Don't underestimate it.\\n\\nBe sure to try the \\\"\"Angelo's Special\\\"\" sandwich with the homemade mayo sauce.","label":1},
	{"text":"Best Pizza Shop in Bloomfield. Hands down one of the best Sicilian Pizzas around! Sicilian Cuts and Cheese Fries are my go to every time I dine here! Plus they sell Turner's Tea!","label":1},
	{"text":"Service was quick. Barbers are friendly and experienced. I was in and out in 15, and only paid 10 bucks. I strongly recommend them!","label":1},
	{"text":"Old fashioned barber shop. Been doing business here for years. Good, fast, cheap.","label":1},
	{"text":"Read some reviews and decided to try them out. Im very pleased with the haircut and even more pleased with the price. Walked right in, no wait, asked for what i wanted and they delivered. Will be returning!","label":1},
	{"text":"Just went there for the first time today, very nice barbers and great price! Would recommend them to everyone!","label":1},
	{"text":"Basic pizza. Pretty solid, not too expensive and open till 11:00 on weeknights. Really not much to complain about.","label":1},
	{"text":"I have only had the lunch buffet, which really isn't fair to write a review off of.  While cheap and I would consider a good deal, it was overall greasy and bland.\\n\\nOnce I go back and order something off the menu I will have to re-review.","label":0},
	{"text":"Way better than India Garden. The interior isnt that great, but the food more than makes up for it. The buffet is a great price and you get a good selection.","label":1},
	{"text":"Delicious food and reasonably priced, especially if you go during there happy hours!","label":1},
	{"text":"The lunch buffet on Saturday is great hangover food.  it is cheap, hot, refreshed often, and has the standard selection.  I love going here.","label":1},
	{"text":"I take back everything I said in a previous post (about all Indian restaurants tasting the same and that it all tastes like something out of a box)!!\\n\\nI was so completely wrong! \\n\\nPeople's is amazing and fresh, vegetarian friendly, pleasant staff, warm and inviting.","label":1},
	{"text":"Went here for dinner twice in 1 week when I was craving Indian food. The food is pretty good compared to other Indian restaurants in Pittsburgh. Also, it's BYOB with no corkage charge. The service is also great. Just took off one star for the naan- it was a little burnt each time I came here.","label":1},
	{"text":"This is closer to home-cooked Indian food than your average Indian restaurant. The lunch buffet is yummy. The chai is absolutely delicious!\\n\\nI am there almost every weekend for their lunch buffet. Yes, it is that good!","label":1},
	{"text":"No way, dudes. Go down the street and get some tastier food at Tram's Kitchen. The grub is better, the restaurant itself is a little cleaner (not saying much on either account), and the water even tastes better. \\n\\nReally. I'm not joking about the water.","label":0},
	{"text":"It's a nice small and authentic market that's just one block off the main strip. I absolutely love this place! If you come at the right time, you'll be able to see the fresh ravioli being made right in front of you.","label":1},
	{"text":"I walked in to try the fish sandwich that I have heard so much about but decided not to stay. The smell of smoke is over powering.  If your not a chain smoker, opt for takeout.","label":0},
	{"text":"The bar reeks of smoke and the bar table feels sticky. You'll definitely feel like you're in the deepest hole in the way. The only good thing is that the drinks are cheap. But I really wouldn't recommend going there.","label":0},
	{"text":"Yes, the fish was good. However, the restaurant was dirty, the bathroom smelled so awful that I could not go in it. The waitress was RUDE, CRUDE, and downright  OBNOXIOUS!!!!  Was the fish good enough for me to ever go back - NEVER!!!!!!!!","label":0},
	{"text":"Friendly, kind staff and good service.  I'll go here again and again, for eat-in or take-out.  I don't really have any favorites here...everything is tasty!","label":1},
	{"text":"Love this place. And they have coupons too. The bonus is definitely the amount of food, you get enough for delicious lunch leftovers!","label":1},
	{"text":"Tried the vegetarian thali ($12ish) and was really impressed by the quality, variety, and spiciness to order.  Will head back here with a smile.","label":1},
	{"text":"5:30pm, worst Baingan Bartha I've ever had. Un-fresh and damn near flavorless all but for some powdery heat. Please invest in fresh chillies; they keep well and will make that \\\"\"8\\\"\" really pop with flavor.","label":0},
	{"text":"This was my first time at taste of India. The service was very pleasant and I found the food and alcoholic beverages to be quite inexpensive. Most importantly, the food was fantastic. The flavors were well balanced and succulent. I will definitely be coming around more often.","label":1},
	{"text":"If you really know and like Indian cuisine then food here gonna be flavorless and bland for you. Tandoori chicken doesn't taste like one etc. Decor is tasteless and old. Carpet looks really dirty. I'm definitely not coming back.","label":0},
	{"text":"Not fancy but great Indian food at a really reasonable price. The eggplant was particularly yummy.","label":1},
	{"text":"Great conversationalist, inexpensive and high quality hair cuts, wonderful old school atmosphere. No computers, no expensive hair products they're trying to hawk, just a man doing his craft. Every time I go there I'm so happy this place is still thriving.","label":1},
	{"text":"Pay attention to the bill.\\n\\nCurly haired male bartender intentionally added $20 of drinks to my tab. When I confronted him he blamed the extra drinks on my friends who hadn't been drinking those things in the first place.","label":0},
	{"text":"I don't understand why people love this place. I've been here a dozen times.\\n\\nThe beer selection is decent. The prices are good.  The bar food is typical.\\n\\nIt is just a standard bar to me.  If you want no frills beer and bar food, they are no frills.","label":0},
	{"text":"Favorite local bar! The service is great, owner is on top of everything and her staff is always helpful and friendly. Great karaoke on Saturday nights, Pirates game specials and Meatloaf of Tuesdays is to die for!","label":1},
	{"text":"Jane is so right. The food and prices may be great, but who wants to eat dirt with it? I've seen someone mop the filthy snow tracked floor then put the bucket of water on the deli counter. No thanks. I'll pay a little more for sanitation. There are other Italian grocery stores close by.","label":0},
	{"text":"great place.  great food.  perfect spice level and it doesn't interfere with the flavor.  had an everything bowl with vermicelli and some egg rolls.  very good.  quick for lunch too.   excellent pricing.  cant wait to eat here again.","label":1},
	{"text":"This place isn't much to look at, but when the I'm talking about a restaurant ambiance falls second to good food. The pho here is great. Really flavorful with a great balance of ingredients. I need to go back and try the Bun.","label":1},
	{"text":"stop 4 on our 7 state pho tour - and everything else you read is true.\\n\\nmy thoughts were like this...\\nsmall, border line clean, authentic, no tripe?, took forever to get food on the table, excellent pho, nice little place.","label":1},
	{"text":"awesome vermicelli with coconut milk. if i lived around here i would eat at tram's every day. actually, i live in san francisco, which (obviously) has excellent restaurants, many of them vietnamese. i would put tram's up against any of them, any day of the week.","label":1},
	{"text":"Although everyone comes here for the pho, i also like the fried rice and the egg noodles with tofu yummy! yummy!","label":1},
	{"text":"I am from Houston, since I came here I've been searching for the perfect bowl of pho. I have to say this is the closest thing yet from home!!! Good pho with fair pricing, doesn't get ebtter than this.","label":1},
	{"text":"Went here last weekend with friends. Two of us became violently ill with food poisoning. Ordinarily, I would recommend the spring rolls and the pho, of course, but since my trip to the ER, I won't be back here again.","label":0},
	{"text":"My favorite pho resturant in town the fresh rolls are great the pho is very tasty.  The prices are good and the food is great.","label":1},
	{"text":"1.5 / 5 - Beef Pho: Kind of bland tasting\\n2.0 / 5 - Pork Chop: Not much meat and as much flavor as I'm used to, but still good.","label":0},
	{"text":"Love the Hanoi Pho and spring roll. Nice plump shrimp too. Do yourself a favor...it's far from a fashion spot, just real good eats. Reminds of what SF's Tenderloin excellent Cambodian and Vietnamese were back before everything cost an arm n a leg.","label":1},
	{"text":"The best Vietnamese I have tried in Pittsburgh. The Tufu lemon from the appetizers was just perfect. I found the place from Yelp.com and I would definitely recommend it! Very inexpensive too! I really like it!","label":1},
	{"text":"This is my go-to place for Pho. I normally get take out since I live in the area, but sitting here is quite an experience too. This is authentic Vietnamese food. \\n\\nHighly recommend to anyone looking for some good Pho.","label":1},
	{"text":"Delicious.  Side benefit:  cheap.  We got the pork chop split rice and the pork sate pho.  Both were good.  Service is prompt and efficient. Cash only.","label":1},
	{"text":"I love this place.  The vermicelli is amazing.  It is a cozy hole in the wall.  The food is so good.  And it's BYOB.","label":1},
	{"text":"A Pittsburgh classic.  Many, many late nights have I spent here, post strike party, or any other type party, eating the grease necessary to fight off the hangover I deserved the next day.  The waitresses are part of the ambiance.  Love their Reuben.","label":1},
	{"text":"The food isn't something to rave about but it's edible. I love the fact that they offer fried green tomatoes and grape leaves. I have only been to (C)Ritters for late night munchies and that also happens to be when Pittsburgh's finest come out to play. Never a dull moment.","label":0},
	{"text":"At 2am on a weekend night, the clientele is colorful, the service friendly and the food...well just forget about the food.  The food ranges from mediocre to bland.  Just be grateful there is a colorful place to go for a late night meal.","label":0},
	{"text":"Although it's called a diner, it's much larger than that.  It's open 24/7 and has a full menu.  Tough to fault, especially with good food.","label":1},
	{"text":"The food at Ritter's tastes like I made it at home, and this is not an endorsement.  I had the feta and tomato omelet, and it tasted skunked, like it had just been cooked in a dirty skillet.\\n\\nIt's a dirty diner with meh food, but it is open 24 hours.  If you're drunk, I bet the foood is great.","label":0},
	{"text":"Ummm, we're pretty sure my boyfriend got food poisoning here. That was the last thing we had eaten for hours, and the next morning he DEFINITELY had eaten something bad after waking up... yikes.","label":0},
	{"text":"Don't get me wrong, the foods great, but when there's only a handful of booths full it shouldn't take an hour and a half to get breakfast. If you get to the point that you'd rather leave and go to McDonalds just so you can eat something it's too long of a wait.","label":0},
	{"text":"How does this place even stay in business. It's disgusting. The food is crap. Everything is filthy. All the waitresses look like crackheads. They screwed up a club sandwich & fries. How is that even possible?  It deserves negative stars for sucking so badly.","label":0},
	{"text":"What you expect out of a 24 hour diner.  Food can be pretty good, service can be pretty bad.","label":0},
	{"text":"Best brunch ever!  You will have better luck getting seated quickly if you arrive by 10am.  They have the best potatoes in the burgh and it's good food that will stick to your ribs!  The service is always quick and friendly.","label":1},
	{"text":"Awesome food and service.  Family owned homemade itAlian food. They way it's suppose to be. Will go again when I'm in Pittsburgh","label":1},
	{"text":"There has been a pile of vomit on there sidewalk for 10 days, For the life of me I cannot believe they havent taken care of this, such a turn off.  Today is 10/3","label":0},
	{"text":"If you're looking for the best hamburger in the city, this place is \\\"\"it\\\"\".  Go no further.  You won't be disappointed.","label":1},
	{"text":"Putting lamb in your burger is not my idea of 'gourmet' burger. Sure it tastes unique, but there are better ways to skin the cat. Good, but after a couple of times I got VERY tired of the 'unique flavor' of their meat.","label":0},
	{"text":"best burger in pittsburgh**.\\n\\n\\n\\n________\\n** based on taste, price, service and comfortable atmosphere perfect for a casual lunch, or proper dinner.","label":1},
	{"text":"Eh,\\n\\nSo much hype, but the burgers are over ground and too big for the bun.  Maybe it was just over hype, but I want all the wonderful burger things to occur when I'm munching a burger, not just tons o' ground beef in a bun.\\n\\nTry BRGR just up the road.","label":0},
	{"text":"This is the only burger place I have ever been to that doesn't serve french fries. WTF? Went once, only due to bad weather, and would never go again.","label":0},
	{"text":"A classic old-school joint. The bar dates back I don't know how long. And the service has that old-school quality. I wanted for nothing. I was stuffed by the burger they served me. It was tasty and delicious. I can't wait to go back and enjoy another.","label":1},
	{"text":"After getting one of their \\\"\"famous\\\"\" burgers, I really don't understand the hype. Mediocre food and mediocre service.","label":0},
	{"text":"This is not only the best burger in Pittsburgh. It's also the best burger in the USA. Cooked to perfection. \\n\\nThe home fires are off the hook too. \\n\\nThere is other stuff on the menu but stick with the burgers. \\n\\nGreat eats. When in Pittsburgh I will make time for a stop at Tessaro's.","label":1},
	{"text":"As an update, if you get the veggies as your side don't get them cooked on the grill. Sometimes they will do this and char them a bit which is delicious but if your burger is cooked in the same spot the residual plant matter sullies the flavor of the meat.","label":1},
	{"text":"I went at lunch, so it was a little crowded for my liking, but that's to be expected. Despite how crowded it was the service was excellent and I very much enjoyed my HUGE breakfast burger. Reasonable prices, cute, local place. Would definitely go again.","label":1},
	{"text":"The food here is very good.  I did find the service a tad slow but of all the italian places in this area I would go here first.\\n\\nI had an italian hoggie that was very good and yes they do have excellent meatballs.","label":1},
	{"text":"not my fav! weird mixture of sit-downy restaurant and bar, with neither being really good.","label":0},
	{"text":"Despicable service at the bar, very selective about who they serve, and incredibly rude when you request service after they ignore you for 20 minutes.","label":0},
	{"text":"This place does not have good italian sauce it tasted like chef boyardee and my crab cakes were not cooked in the middle it was cold. I wont be back.","label":0},
	{"text":"Clean and professional.  Not so cozy beds during the winter.  I was able to get extra towels when we asked for them  Parking does suck as the other review stated.  But we are in Pittsburgh!  It was what i expected!","label":1},
	{"text":"Oh Twisters is fun. We had ice cream here not long ago. I had some Blizzard-type thing, and it was delicious. The girl behind the window was a sweetheart too. I loved her hair and piercings.","label":1},
	{"text":"They have so many oldies but goodies! However, they stopped making the homemade ice cream sandwiches because they don't have the wafers :( Still a nice treat.  FYI, they only take cash","label":1},
	{"text":"Out of my three day, 3 state bar crawl this was my favorite bar. Service was good, the beer selection wasnt amazing but okay, and they had shuffle board. But what sold me was the Silky's had that homey feel to it.","label":1},
	{"text":"Excellent food! Excellent service! I would highly recommend this place to anyone who wants a great meal with great service.","label":1},
	{"text":"I love this place for a quick bit!! If ur on a diet this is a great to stop for fast food ..yummmyyy lunch stop","label":1},
	{"text":"It took more time to write this review than it did to get my oil change. Nice location.","label":1},
	{"text":"They are friendly professional reliable quick I think that's enough . I keep coming back to them because I trust them.","label":1},
	{"text":"$400 IN DAMAGES\\n\\nThey cracked my oil pan and it cost me four hundred dollars to repair. Everything was fine before I brought it here. Mechanic said it looked like they put my bolt in crooked and then hammered it in. Avoid at all cost. They will ruin your car.","label":0},
	{"text":"Terrible experience. I dropped my car off at 9:25 AM on a Saturday and there was one other person in front of me. I didn't leave until 11:05AM and was charged $99 for a synthetic oil changed. Overpriced, terrible customer service, and long wait times. Never coming back here.","label":0},
	{"text":"Very bad service. They are extremely slow. I waited 90 minutes even though there were just 2 cars in front of me. I bought the signature service which includes vacuuming which they didn't do at all. When I told them that, they just lied and said they did. Never going back here!","label":0},
	{"text":"Go there only if you want served uncooked fish, odd tasting salad, or way too sweet tea (btw - no unsweetened).","label":0},
	{"text":"Dude. We're over here. No? No eye contact?  Too busy with your iPhone?  \\n\\nThe bartender was beat. We left without being acknowledged or served (and we literally waived our arms).  Could be good, but who'd know.   Wasn't busy either.  You're fired.","label":0},
	{"text":"Atmosphere Nice / Sports on every television with Volume Up Boooooo!\\nBread Pudding by far the Bestest in the Burgh!","label":1},
	{"text":"Mama Ros's (sic) is a great place to eat late at night or early in the morn. They have weird hours, weird cooks, weird customers, and great food. \\n\\nThe price is great and the silver dollar pancakes are soooo good.","label":1},
	{"text":"Very average Italian food.  If you're looking for a pasta+sauce experience, it's pretty boring.  Eggplant parm was a little better than average.  But all in all, not any more exciting than what I can make for myself with a jar of sauce and box of pasta.","label":0},
	{"text":"I had a wonderful experience at this restaurant bringing 8 out of town guests from across the country. The food was outstanding and the wait staff is very accommodating. Alex made a special effort to make sure our time there was enjoyable. Good authentic Italian cuisine at a very reasonable price.","label":1},
	{"text":"Suffice it to say, this is not real Italian food and it's below average and overpriced when it comes to American-Italian food. The staff was excellent though and you will have great service and conversation. Thanks but probably won't be back.","label":0},
	{"text":"One of my favorite Thai places, maybe ever.  Fresh, sweet, spicy and all around good.  Not super heavy or cloying sweet.  Friendly service and all at a fair price.  \\n\\nI hate hearing my neighbors, though.","label":1},
	{"text":"Delicious-- try the spicy basil noodles.  Really relaxed atmosphere, nice low lighting, friendly staff.  Your water glass will never get more than a third empty!  \\n\\nOh, sometimes I really miss Pittsburgh.","label":1},
	{"text":"I'm not a Thai food expert, but I really really enjoy their food.  The 3 spice duck is great, Pad Thai is fantastic, as well as almost all the appetizers.  The servers are so nice and accommodating.  The decor could use updating.  Closed on Tuesdays, which somehow is always the day I'm craving it.","label":1},
	{"text":"DON'T JUDGE A BOOK BY IT'S COVER.\\n\\nA hidden gem, this place is phenomenal - best Thai food I've ever had. You need to go here.","label":1},
	{"text":"Our favorite place in Pittsburgh for Thai food! Service is excellent!!! We're kind of regulars now and we always get lucky to be served by this white guy who is awesome and polite. Their food is a little expensive but its so good. Try their tum yum veggie soup!!!! My favorite!","label":1},
	{"text":"Awesome!  We ate here several times and everything was very good.  Good service, clean place, and the noodles...","label":1},
	{"text":"Excellent Thai food. The red curry, crab fried rice and Pad Thai were very good as was the seafood soup.  Service was awesome!","label":1},
	{"text":"very delicious and good service. byob, which is a dream. love this place.","label":1},
	{"text":"I will start my review by saying that I am not a Thai food expert, but I love Thai Cuisine!  My friends have a hard time talking me into trying any other Thai restaurant as I keep coming back here.  I'm hooked!","label":1},
	{"text":"The Tom Kha is delicious. All of the curry's hit the spot as well, my favorite is the red bean. Thai Cuisine has many traditional dishes as well, don't be afraid to try something you've never had before. As far as my decade of experience goes here, all of the food is good.","label":1},
	{"text":"Great food, never had a bad meal there.  I love that they get their desserts from Signature Desserts.","label":1},
	{"text":"I haven't been to the Getaway in a few years, and now I remember why.  Aside from my hubby, who got a burger and fries, we were all rather underwhelmed with our dishes.  Once upon a time this place used to be really good.  Now not so much.","label":0},
	{"text":"I feef that the waitress was not trained correctly and she should never have been fired","label":0},
	{"text":"A south hills legend.  The only problems are a total lack of parking and long wait but a great pizza if you can be patient.","label":1},
	{"text":"I've travel 52 weeks per year. I grew up in Pittsburgh, lived in Chicago for 5 years came back this year.  Been to Italy, New York...Fiori's is the best.  Sauce is great, cheese is great, service is always friendly and entertaining.  I have been going here for 20 years.","label":1},
	{"text":"Yes the pizza is the best in the burgh.  But don't don't forget the wings.  They also have the best wings in the burgh.  They don't deliver.  They don't have to.  I'd drive for miles.","label":1},
	{"text":"Their cheese pizza is a must have if you're visiting Pittsburgh. Period. It's where all the locals go and you should too!","label":1},
	{"text":"The sales team worked with me to trade a car that needed work and put me into the car I always wanted for a price I could afford.  Talk to Jeff and Dom they are Awesome!","label":1},
	{"text":"We've been to a lot of car dealerships in the last few weeks, and this was hands-down, the worst experience of the bunch. We were first ignored, then made to sit and wait for pricing for more than 20 minutes, for no apparent reason. We will definitely not be going back.","label":0},
	{"text":"Love the store. Nice stuff. Price reasonable. BAD parking...Employees at this location are nicer and willing to help compare to the one at Ohio River Blvd....Easy check out. Friendly staff.....","label":0},
	{"text":"It's a like a stampede when you enter this store! The least of the problem is the other shoppers, but the staff are gruff and unfriendly. Wasn't worth it for me.","label":0},
	{"text":"Parking sucks. It smelled. They are way way overpriced!  I saw a bag priced at $15 that was apparently donated from a yard sale because it had another tag for $3!  Just really lots of junk. Also it's a cash only place but they do have an atm. Their clothes are sorted by color which is cool.","label":0},
	{"text":"Very good!  The dinning room is located in the back behind the bar.  You must get the fried zucchini!  Their breading is so light yet flavorful!  The portions for the entr\\u00e9es were HUGE!  Service was great, and everyone was very friendly.","label":1},
	{"text":"Absofrigginamazeballs!  This place is the bomb!  Great food, friendly service and a little grocery in the side. Who could ask for more!?!  The falafel pita will astound. Yummers!","label":1},
	{"text":"Love this bakery! It is my favorite in Brookline and always has delightful treats and wonderful staff. \\n\\nJust recently bought a King Cake for Fat Tuesday, and it was by far the best I've ever had and very affordable.\\n\\nStop by for snack!","label":1},
	{"text":"owner is a terrible terrible person. tossed me out for no good reason. i found the food very average overall","label":0},
	{"text":"Worst McDonalds!!! they took 45 min for one burger BULLSHIT!!! someone needs fired!","label":0},
	{"text":"Had the chicken kabob and hummus. Didnt enjoy either, hence, the two stars. On the other hand, the bartender was really nice. Might give a second try.","label":0},
	{"text":"Lunch was outstanding! Double down with hummus and tabulee.\\nWill be back for dinner soon!!","label":1},
	{"text":"Wonderful surprise in the South Hills desert of chain eateries. Romantic interior that's a refreshing throwback, and the best hummus and iced tea I had in Pittsburgh. The kebabs are sizzling, generous, and delicious, and the staff friendly.","label":1},
	{"text":"If you're seeking bland, salty, Chinese food where every entree tastes exactly the same as the other...this is your place!","label":0},
	{"text":"Absolutely amazing I usually don't venture out and we went to a new restaurant and I got a new dish, Capitol chicken it was truly amazing, wait staff is always there when you need them. would definitely go back!","label":1},
	{"text":"The oil to sauce ratio for my Kung pao chicken was 1:1 - maybe worse.  I couldn't eat it.  I literally had to rinse it off under hot water in order to salvage a few bites.  This isn't the first time that I have had this problem here.  Takeout is gross.  I won't be back.","label":0},
	{"text":"NEVER EVER get the All-you-can-Eat. Hibachi plates are basically plates of panfried squash with a little meat that isn't even grilled. They give you nigiri sushi instead of sashimi. It's like they are trying to stuff us full of rice and squash so we fill up quickly. Also, service was unfriendly.","label":0},
	{"text":"excellent service.  really good with the kids.  the owner Joe always provides excellent service","label":1},
	{"text":"Great service, quality work, good prices.  What more can you ask for?  Oh, I know... it's independently owned.  Love it!","label":1},
	{"text":"Il Pizzaiolo serves authentic and delicious pizza and pasta.  I highly, highly recommend eating in the \\\"\"wine bar\\\"\" out back - where the main restaurant is loud, bright, and crowded, the wine room is darker, more romantic, and closer to the bar.","label":1},
	{"text":"My local go-to for a great meal with friends. Always delish, fresh and well made meals, great wine, warm atmosphere. I'm lucky to have Il Pizzi a block away.","label":1},
	{"text":"Passing through town, tried this place bc of Yelpers. Was not disappointed, the pappardelle with sausage was awesome, pizza great, and don't forget the tiramisu!","label":1},
	{"text":"Although there are plenty of new brick oven pizza places popping up in the burgh almost monthly, this is still the best.  Robertos is the only other brick oven that compared.  Now that Roberto is in the Village, NYC this is certainly the tastiest spot left.","label":1},
	{"text":"Delicious, up scale pizza. Not a good place for young kids. Lovely patio.","label":1},
	{"text":"I can only add to the already good reviews on Yelp. The outside area was very pleasant. The food was simply very good traditional italian. Highly recommended.","label":1},
	{"text":"Love the margherita DOC, love the dessert. Brick oven pizza is a favorite of mine. I like to try many different places & this is a favorite of mine!","label":1},
	{"text":"I have tried II Pizzaiolo twice now and I am not a fan. The food was very good but over priced and the atmosphere is stuffy and very loud. If you are looking for a relaxing night out, this is not the place to go.","label":0},
	{"text":"$20 for a personal pizza with cherry tomatoes, and \\\"\"some\\\"\" smoked Gouda. \\n\\nNo salad. No meat. \\nNo dice. \\nBetter deals and better food at a mall food court.","label":0},
	{"text":"With prices this cheap,\\nI expected bland sushi.\\nBut hey, it's Pittsburgh.","label":0},
	{"text":"Very good sushi.  Enjoyed all of it.  Great salad and soup as well.  Make reservations, esp on a weekend.  The only thing we DIDN'T like was the continual (loud) birthday celebrations.","label":1},
	{"text":"Let's face it,  this is not Japanese food. The food is ok but it is really more or less Chinese food. The soups taste Chinese and lack the umami quality because they are not hon-dashi based. The rice used for the sushi is totally incorrect long grain rice, and not properly vinegared.","label":0},
	{"text":"Love their sushi here. You can't go wrong with anything on the menu. There is on street parking, and also a parking garage across the street.","label":1},
	{"text":"Best spicy tuna that I've ever had.......because it's actually spicy and without the spicy (American) mayo.","label":1},
	{"text":"Second best sushi in Pittsburgh after Umi. Great uni and eel. Would recommend the sushi and sashimi over other dishes here.","label":1},
	{"text":"Some of the best sushi in Pittsburgh. Everything was really fresh and light which sushi should be, but this just seemed better. Hard to find a soft shell crab roll that the tempura is done well. This place does.","label":1},
	{"text":"Best pizza in the 'Burg! They definitely don't skimp on the cheese and the sauce is awesome....it has a fresh tomato taste to it that goes well with the crisp, nutty crust.","label":1},
	{"text":"Horrible.  Tried it several times.  Taste like frozen Pizza.  Found a hair in it the first time so against my better judgement tried it again.  I swear it was worse than my first experience.  The locals that like this joint must have smoker destroyed taste buds.","label":0},
	{"text":"Needs more registers in the mornings. Mildly unorganized. But the breakfast sandwich is worth the wait.","label":1},
	{"text":"This is a crappy, dark theater that leaks water when it rains. Do not go!","label":0},
	{"text":"Such a shame. Terrific location, supported by the community and just awful. Filthy, bad seats, more expensive than others. Choose to go elsewhere.","label":0},
	{"text":"Why does this place always smell bad? Seriously, the second you walk through the door it's vaguely sewer-ish. Their roof deck is okay, and I am honestly glad that not every establishment in Lebo is high-end, but overall I'm not a fan.","label":0},
	{"text":"This place is just okay.  Food isn't that great.  It's kind of dark & dingy.  Lots of TV's though.  I prefer Cain's Saloon...just right down the road.","label":0},
	{"text":"At the pub/restaurant side I had a very bad experience, terrible food, even worse service.  A complete waste of money, avoid at all costs.","label":0},
	{"text":"Awesome spot with good beer, a pool table, darts, and even board games. Haven't been there when it's busy so service was always top notch.","label":1},
	{"text":"Flowers for my July wedding turned out gorgeous, I'd highly recommend Mt. Lebanon Floral!  (my bouquets/centerpieces were faith roses with cream hydrangea)","label":1},
	{"text":"This is a nice small mall. Some of my favorite shops are Anthropologie & Pottery Barn Kids. There's a Starbucks and Panera inside. No problem with parking and the mall isn't overcrowded at all.","label":1},
	{"text":"Pittsburgh Restoration Hardware has the worst customer service ..stay away.","label":0},
	{"text":"This is a great place with good products that serves and caters to everyone.  I would miss it terribly if it was not there.","label":1},
	{"text":"Mediocre sandwiches and milk shakes. Also, the woman behind the counter was very rude and had a terrible attitude.","label":0},
	{"text":"This is the go-to cafe in Mt. Lebanon nowadays. There's plenty of room and the space is welcoming. \\n\\nThe coffee is terrific and the barista welcomes and chats with customers. The pastries and sweets are always evolving, so every time you visit there will be something new to try.","label":1},
	{"text":"Not a huge fan of their coffee, the cookies and pastries are really good, however! The lemonade is amazing. The lady who works their, is super rude and never smiles. The customer almost feels like they are bothering the workers.","label":0},
	{"text":"This is a fun shoe store in a great neighborhood. Prices are reasonable. The selection is great, but they were out of my size in several shoes that I wanted to try. Service was average.","label":1},
	{"text":"i must admit that i'm shocked at the poor reviews for this coffee tree roasters location.  though i don't spend time in the store, i always grab an espresso or latte whenever i'm in shadyside.  i absolutely love their beans.  i even buy their whole beans to brew at home.","label":1},
	{"text":"The vanilla lattes are a little sweet, but delicious. This place is perfect when the weather is nice and they can open the garage door. It's definitely a must-visit coffee shop on Walnut.","label":1},
	{"text":"They lost 2 of my shirts and a pair of my jeans - they were also EXTREMELY rude when I tried to find my stuff and did not offer any help.\\n\\nThey are unreasonably expensive as well\\n\\nDO NOT GO HERE - THE HIGH RANKINGS ARE FROM THEIR EMPLOYEES!","label":0},
	{"text":"the staff is super friendly. I drop off laundry for my business and they do a great job. And yes, they are so much cleaner than any of the other places in Pittsburgh that I have used.","label":1},
	{"text":"Clean very clean present people $2.10 for shirts and I hate doing launder at a mat but if I have to then I will do it hear.  It's worth the extra buck to do it some where thats clean has WiFi a tv for the game and is right next to a bottle shop and a bar. Ok everything is stainless.","label":1},
	{"text":"i'm a total fan of eons. love their selection! a little pricey though.","label":1},
	{"text":"Meticulously organized and a great selection. Definitely worth a stop.","label":1},
	{"text":"Good selection, well organized, friendly staff!  \\n\\nOn my quest to explore Pittsburgh, I stopped by Eons and ended up trying on a few things.  I wasn't really on a quest to find anything though, but I could see myself spending hours in there shuffling through all the racks.","label":1},
	{"text":"This place defines \\\"\"vintage clothing shop\\\"\". It's small, packed, and well organized. You must stop in here, even if you don't think you want vintage clothing. You will. The selection is amazing, and the staff could not be more helpful.","label":1},
	{"text":"I went here once when I first moved to Pittsburgh. My shirts came back poorly pressed and some had broken buttons. I was disappointed.","label":0},
	{"text":"I went here once to get my pants hemmed and got yelled at for not purchasing proper pants in the first place. I was too startled to respond but have since thought of many  witty replies. Oh well.","label":0},
	{"text":"Do not use this cleaner.  Quality is poor. They ruined three shirts of mine, tore two of them and shrunk another down. Refused to replace them or compensate me for the loss. They do not stand by their mistakes.","label":0},
	{"text":"THE place that I went for a nice conversation + cocktail combo in the 'burgh. Great atmosphere, great drinks, great food. Ahh, Soba. If only all Pittsburgh restaurants could be like you, the world would be a better place.","label":1},
	{"text":"Only went there once -- it's nice, but not so rave-worthy as other reviews might imply except in comparison to the other offerings in Pittsburgh. Food was good but IIRC, the portions are small -- you end up spending a lot of money in order to feel moderately full. Drinks are good.","label":1},
	{"text":"I don't see the big deal about Soba Lounge. I thought the food was only okay, and I didn't like all of the flavors overpowering each other. The ambience is really nice, and the servers are friendly, but the food was just alright for me.","label":0},
	{"text":"So underwhelming. I've been here a few times and have always been disappointed. Last night the service was especially lackluster. And the kitchen closed and 10, so no snacks for us later in the evening . They do make a good French Martini though.","label":0},
	{"text":"Get a martini\\nOr anything else they have\\nThis place is heaven\\n\\n\\n(b)","label":1},
	{"text":"Awesome service, food very good, but a tad salty for my taste. Great ambiance!","label":1},
	{"text":"Excellent food. They did a great job with the renovation- the place is swank!","label":1},
	{"text":"Soba is great! The food is delicious, and sometimes (positively) surprising. For example, their mashed potatoes have an asian twist to them and are a little bit spicy! I like the atmosphere, interior and the service has always been great.","label":1},
	{"text":"Went to Soba to celebrate my sons birthday. Quality of food was not at all what was expected for the price. We have eaten there several times in the past but not sure that we will be going back anytime soon.","label":0},
	{"text":"The crab meat corn-chowder appetizer is the finest appetizer I have ever had in my life. I have been to most of the great restaurants in New York City over the past 30 years, and that statement stands.\\n\\nJust fabulous.","label":1},
	{"text":"Amazing Two Fish Tempura Fat Roll...one of the best things I've tasted, seriously.\\nExcellent Thai Corn Chowder.\\nIncredible Black Cod.\\nThis place does Asian Fusion well!","label":1},
	{"text":"A great salon experience in Pittsburgh. Johnnie was fab and trimmed my hair exactly to my liking. Highly recommended!","label":1},
	{"text":"This is the real deal...in Pittsburgh. Don't expect flop down for a casual California roll here. They take the sushi and the experience very seriously. The downside is that it you'll never be satisfied with average sushi again.\\n\\nPro tip: make reservations days in advance.","label":1},
	{"text":"Very fresh sushi and great atmosphere. The chef gave us complimentary appetizers and desserts, but we gladly gave the house more business by ordering tasty sushi and drinks.","label":1},
	{"text":"Excellent cocktail menu first of all, followed by an excting dinner menu that has not failed yet. Sushi has always been fresh and perfectly presented. I've made this a regular on my dining rotation.","label":1},
	{"text":"Best sushi in Pittsburgh. Small restaurant so definitely make reservations and try the omakase. Like the tatami mat seating as well.","label":1},
	{"text":"Paid $1100 for the required course - party of 6 - and unfortunately did not come close to feeling satisfied in any regard - sorry guys - not a fan and way overpriced","label":0},
	{"text":"Lots of options. The sandwiches are moderately priced and good. Avoid the cupcakes - they are dry.","label":1},
	{"text":"Don't come here from NYC looking for a good bagel and lox, stick w the ice cream.","label":0},
	{"text":"Okay bagels though a little overpriced. Been to squirrel hill location and Ellsworth location once each. Have consistently had rude customer service. Really turns me off. Won't be going back even though the bagels are okay.","label":0},
	{"text":"This place just bored me.\\nReally don't know what to say.\\nBored, bored, bored, bored, bored.","label":0},
	{"text":"Appearance is best\\nThe drinks and food don't live up\\nTo expectations.\\n\\n\\n(b)","label":0},
	{"text":"Completely surprised by this place! The drinks were good, strong & cheap. The food was excellent. For 3 vodka drinks, 2 beers, chicken & veggie quesadillas and mini burgers, we paid $35. Cute, dark, little place with outside seating. We sat at the bar. Got great service!","label":1},
	{"text":"Best vegetarian chili on the planet! \\n\\nI love their pierogies.  The menu is unique and diverse.  Alcohol selection is great too!","label":1},
	{"text":"I had a great time.  great food and cocktails.  exciting ambiance, not for a quiet night out.  but who wants that? :)","label":1},
	{"text":"The place is good for drinking but definitely not to have a meal. There're not much options on the menu. \\nI tried the pasta once and it was tasteless.","label":0},
	{"text":"I don't understand why this place is so popular.  I've been there 4 times and each time the food was pretty gross.  Most recently, I ordered a Del Monico sandwich and the thing was dripping with oil.  The beer list is decent.","label":0},
	{"text":"Holy lord Mac and cheese with pulled pork and chili. Very good man drinks, very good lady drinks. Food service and staff. I like that they don't take reservations. Nice outdoor seating area.","label":1},
	{"text":"Great atmosphere, good food, and lots of unique cocktails. The patio is very pleasant in the summer.","label":1},
	{"text":"Great evening. \\nBasics:\\nGreat service, \\nVery good food..hamburger Helper ( not like I remembered )\\nVery good beer with pumpkin for my wife and met with her approval!\\nDesert ...homemade cookie with Ice cream and whipped cream was perfect\\nCheers","label":1},
	{"text":"I stay 2 blocks away from Harris Grill. I have been to shiloh's grill as well, a caouple of times. Harris Grill used to make awesome food an year ago..now its just boiled vegetablea..steak cut out for you..who would want that!!!!","label":0},
	{"text":"Great location but low on amenities.  HVAC system is ancient and the noise factor on Fifth Avenue is problematic. The price is nice but that's all I can say about the positive.","label":0},
	{"text":"Nothing special about this place. Great location but the facilities are a little tired.","label":0},
	{"text":"Comfortable place that is our most frequent and favorite dining spot......if Norm and Cliff ever moved to Pittsburgh, this is where they would hang...........we like all of their food! Finding a place to park is my only complaint.","label":1},
	{"text":"use to be a max and erma's and if that bar wasn't low enough it now misses the mark","label":0},
	{"text":"Drinks are good but food sucks. I tried the food multiple times and I think only the french onion soup and salads are descent. The main courses are very low quality.","label":0},
	{"text":"Wonderful brunch. The food and service was great. The waiters were very friendly and the food wasn't too pricey. Really a great option for brunch.","label":1},
	{"text":"This place is definitely great. Any entree I have had has been excellent.. The service is great too. Bartender is very friendly and the atmosphere is very nice ! I'm going to be a regular for sure!","label":1},
	{"text":"Always enjoy coming to The Elbow Room. Atmosphere is great. Food is great. Jason was our server. He did an excellent job! Highly recommend asking for Jason.","label":1},
	{"text":"If you are into crooked haircuts and terrible customer service, this is your salon.","label":0},
	{"text":"Good Food, Good Beers, Better Prices.\\n\\nTry the Patio outback, you'll love it.","label":1},
	{"text":"Weirdest nights ever.\\nWormhole tequila black-out.\\nToo crowded/hot/cold.\\n\\n(b)","label":0},
	{"text":"The waitress told us we had to leave our table right after we paid our bill (and tipped her generously) just because we hadn't ordered another drink. I have never been treated so rudely by a waitstaff before in my life.","label":0},
	{"text":"It's a sports bar... I've heard the wings were good, but the bad hip-hop was too loud to be worth staying for more than one glass","label":0},
	{"text":"If you are looking for a good place to catch a game and have some pub food and drinks with a Pittsburgh flavor, this is your place.","label":1},
	{"text":"Fries: 5 stars \\nCheesesteak 5 stars\\nno non alcoholic beer 0 stars\\nLocation 4 stars\\nInterior:  2 stars\\nBonus points for service and longevity","label":1},
	{"text":"Best bar on Walnut.\\nGo here anytime of day,\\nThey will have your fix.\\n\\n(b)","label":1},
	{"text":"Can't comment on food since I was just in for beers.  \\n\\nOkay crowd, friendly bartender, okay beer selection, but it's pretty tacky, and not really in a good way.  Looks like the last time any money was put into the place was maybe 1979.","label":0},
	{"text":"I was surprised how good the food was. Great service very friendly people.","label":1},
	{"text":"Horrible service. Waited 50 minutes and had no food and had to ask continuously for more coffee. Don't come here","label":0},
	{"text":"Come here for the jelly sandwich cookies. BEST jelly sandwich cookies ever. they're round, 2 layers, powdered sugar, and you can see the jam in a little cut out circle on the top layer. Their \\\"\"burnt almond torte cake\\\"\" is supposed to be really famous, but i always got distracted by the cookies...","label":1},
	{"text":"White chocolate raspberry cup, chocolate peanut butter bar, burnt almond torte, oh my!","label":1},
	{"text":"This is always a treat... the beloved burnt almond torte lives up to the hype and is never a disappointment.  Seasonal items like pumpkin gob is enjoyable as well.  Prices are affordable, though you may need to go elsewhere for the perfect coffee to pair with your dessert :D.","label":1},
	{"text":"Wow! Their burnt almond torte is a Pittsburgh staple, and the few other things that I've tried from them have been equally delicious! I highly recommend checking out this bakery.","label":1},
	{"text":"I don't even like cake, but, the best dessert I have ever had is the Burnt Almond Torte from Prantl's! It is so delicious, nothing compares!","label":1},
	{"text":"If you want to get pastries while being yelled at by the staff and treated like dirt, this is the place for you.","label":0},
	{"text":"Very good doughnuts! Only purchased the glazed but if you heat it up it's oh so good. Also, the cinnamon roll was delightful. Not a fan of their cookies, but hey everything else is very good. If you have a sweet craving, this is definitely a top spot to come pig out at.","label":1},
	{"text":"Best doughnuts in Pittsburgh. \\n\\nI generally pass on other baked goods. Mediocre bread.\\n\\nGenerally unfriendly staff, but Walnut St. attracts pretty arrogant customers - so it makes sense.","label":1},
	{"text":"Horrible service. I have never been treated so poorly in a cafe. The coffee wasn't spectacular, and it was fairly expensive for what it was. Head down to Starbucks or the Coffee Beanery.","label":0},
	{"text":"This place went from awesome to worst after it changed owners. It used to be simple to buy coffee. They used to have a white mocha but not anymore. I miss the old owner of the place. \\nBut still support small caf\\u00e9s!!!","label":0},
	{"text":"Pamela is a bad representation of this location! Attitude and lack of hygiene is an issue for this \\\"\"employee.\\\"\" I will not return.","label":0},
	{"text":"Such a great store. They stock everything (EVERYTHING), including: cards, hand puppets, necklaces, books, etc... Kards Unlimited seems to take great care in choosing store products for sale. Definitely my favorite store on Walnut.","label":1},
	{"text":"Large selection of unique/cute-tastic gifts.  Humerous knick-knacks/books galore.  Very adorable and staff was very pleasant.  Looking forward to going back again.","label":1},
	{"text":"First time having Afternoon tea time in the States. This place is very beautifully decorated. We had the Earl Grey and peach ginger tea. They were really good and the tea stand was AMAZING","label":1},
	{"text":"Didn't havana go out of biz? I think this is the place with the purple awning. If not, oops! This place is OK. It does have a swanky feel and the martini's are OK but overall it is nothing special. Usually the place is very empty compared to the other bars on Ellsworth.","label":0},
	{"text":"This bar smells like a smoky urinal cake, all the time.\\n\\nI only go in to buy six packs.  The bar staff seems nice enough.  It def seems like a frat crowd.\\n\\nThey get 2 stars only bc there is a skee ball machine.","label":0},
	{"text":"I am in the service industry and my friends and I came here for my birthday. It was the worst experience and the bartender wouldn't give us lemons or limes for our drinks. She was rude and all over the place. We would have spent a lot of money but she deterred us from that.","label":0},
	{"text":"Selection of specialty and regular items is quite good. BUT, the layout, checkout and parking lots are literally the worst clusterfuck I've seen outside of New Delhi. Not bad after hours but those hours are pretty narrow.","label":0},
	{"text":"The good: large selection. \\nThe bad: the crazy high prices, missing price labels, inconvenient location. \\nIt's come to the point that I avoid this place if I can. Aldi's is better for the basics and Pearl Market in the Strip district has better produce for 4x cheaper than this place.","label":0},
	{"text":"Another bad experience.  The staff is sloppy.  The deli doesn't mark the product and passes off whatever slimey old crap they're trying to get rid of as what you ordered.  And good luck parking.","label":0},
	{"text":"I got tired of waiting in line with one register open and 10 people in front of me. Won't be back.","label":0},
	{"text":"Best place in the city for drop off laundry I've found so far. Period.","label":1},
	{"text":"Fun store! Though I just spent a couple minutes here while my husband was browsing, I loved the old fashioned vibe. Plus, the owner seemed to be very hands-on. Not only was she helping a lot of customers find particular items, but I heard a couple customers even address her by name as they entered.","label":1},
	{"text":"Decent price on domestic pitchers. Entrees were half off but all looked mediocre. Tried the jambalaya and it was so so. Big groups of patrons led to pretty slow service.","label":0},
	{"text":"Hey Doc!\\n\\nI dig your deck.  And I also like specials that involve a $7 pitcher of good beer!\\n\\nOh, and great service!\\n\\nThanks for all that!\\nMichael E","label":1},
	{"text":"Platinum Blonde Perfection.  Jay works wonders and he has given me the best platinum blonde 'do ever.  It was gorgeous.  My hair looked like corn silk.  If I had boat-loads of money, I'd fly him out to LA every 6 weeks for a touch up.   Go to see Jay...tell him Laura from LA sent you.","label":1},
	{"text":"Great salon for hair...not so much nails. My hair stylist Vanessa is great. I can go in without a clear picture of what I want and she gives me exactly what I wanted. I get so many compliments on my hair.","label":1},
	{"text":"Although this store has great employees, it is in desperate need of a makeover.  It is absolutely ghetto inside.  I don't think they've redone the store since the early 90s.  It's an embarrassment on Walnut.","label":0},
	{"text":"I do admit the clothes here are not exactly at the quality that I want, but if you do stop by frequently you can spot some really nice items. And the guy who works there is super nice so make sure you get to know him! He can help you a lot.","label":1},
	{"text":"I just accepted a beautiful ring from Hennes. I have had nothing but compliments and I must say that the ring was beautiful. Unfortunately within 4 days one of the diamonds on the halo was missing. I'm sure that this is a fluke and will be taken care of. But my new fianc\\u00e9 is very upset by this.","label":0},
	{"text":"Cozy and comfortable, our food was really good, and the waitstaff friendly and efficient!\\n\\nThe mussels were great (garlic madness) and they split some entrees for us in the kitchen. wowowow.\\n\\nWill definitely try and revisit next time I'm in Pittsburgh.","label":1},
	{"text":"Pretty darn tasty. Walked in on a whim after a busy night shopping on Walnut and enjoyed the food immensely. It's a noisy and busy atmosphere but that was fine since it was fun to talk a bit to our neighbors. \\n\\nJust don't expect a romantic, quiet evening to yourself.","label":1},
	{"text":"Always a pleasure to eat at this place. I've never had a bad meal.\\n\\nThanks bob","label":1},
	{"text":"The receptionist was ver unwelcoming even on the phone. Very rude. This is my first review, I have never been so annoyed . I wanted to ask a few things before I come for dinner, but the guy just hung up on me. Thanks.","label":0},
	{"text":"Great food, great location, ok service. Sometimes you have to wait for a table despite your reservation. It has a great Italian atmosphere and everyone is talking loudly which makes it a great place for a date or a dinner with friends.","label":1},
	{"text":"Lovely atmosphere, friendly and attentive waitstaff, just a bit crammed--you sit very close to the neighboring tables.  Great meals all around, we will be back!","label":1},
	{"text":"Excellent, We went last night to celebrate my parents 40th Anniversary.  Food was great! Our server Rachael did a awesome job.  The restaurant had neat character,it was a bit loud but it is small, so that's expected.  Wonderful all around.","label":1},
	{"text":"Beautiful ambiance, fantastic service, delicious food, and a personal toast from the owner was a great touch!","label":1},
	{"text":"Lovely, refreshing food, though the menu gets a bit old. Perfect, unique salad dressing. Must try it!","label":1},
	{"text":"Had the chicken here. Was somehow unevenly cooked and bland. So bland. Friend had a vegetarian special, which was better, but still unimpressive. Realize it was only 12$ for dinner, and yet somehow still entirely not worth it.","label":0},
	{"text":"They always take weeks to get things done & overcharged. I was ok with that when they did a good job. But then they stopped doing a good job. Not worth the hassle anymore & do a poor job.","label":0},
	{"text":"I've had many suits, pants, and sport coats altered here. Rocky is a very nice guy who gets things done on time and does great work!\\n\\nIt would be a little more convenient if the establishment wasn't cash only, but in my experience the best places are.","label":1},
	{"text":"They work quickly, but speed isn't worth it if the final product is damaged.","label":0},
	{"text":"i think this is the right place.. near the shopping center? kind of a hole in the wall? i was a little put off by how dirty the place seemed, but the pizza was DELICIOUS. nice and crispy, just like i like it. not stingy on the toppings while not overwhelming the pizza either.","label":1},
	{"text":"I still get nightmares from just seeing Mozart management signs on\\nBuildings anywhere in Pittsburgh.","label":0},
	{"text":"Absolutely horrible. My sink has been overflowing onto my countertops and ruining my belongings multiple times. Management did not even apologize for my inconvenience.","label":0},
	{"text":"Good luck getting out\\nWith your soul and belongings.\\nBring your own flashlight.\\n\\n\\n(b)","label":0},
	{"text":"Wondered into this place looking for some mixed drinks.  The bartender told us they were known for they fruity drinks, but not margaritas.  He could mix any juice with vodka.  We left.","label":0},
	{"text":"Super super strong drinks. Very smoky and small, but definitely worth coming to.","label":1},
	{"text":"Best breakfasts in the Pittsburgh area.  Just make sure to bring cash - they don't take credit.","label":1},
	{"text":"Wow I couldn't even eat all my bacon cheese omelette, home fries, and rye toast, and it still kept me full from 11, when I had brunch, to 9PM!  Usually I hate homefries, but these were great!  I think I can only go here like once a year though, to prevent my heart from exploding.","label":1},
	{"text":"The breakfast special here should be enough for most people. The pancakes are great. The service is generally very good too. The only bummer is the lines for this location (and all Pamela's locations in fact) are super long around brunch/lunch times.","label":1},
	{"text":"delicate and fluffy jussssssst the way i like 'em! \\n\\nwait wasnt tooo bad (5-10 min maybe). its short if its just 2 ppl.\\n\\ni had the choc chip cookie pancake - melts in your mouth son!\\n\\ndef put me into a nice cozy nap mood tho. peep it out at least once.","label":1},
	{"text":"Everything I wanted to say has already been covered in previous reviews, so I'll just leave it at this:\\n\\nOH MY GOD GET THE HOTCAKES\\n\\nSeriously, get them.","label":1},
	{"text":"How Pamela's became a Pittsburgh institution is completely beyond me. The food is average at best (think a step or two above Denny's or Waffle House). Pancakes were soggy and bland and the veggie omelete was chocked full of processed, cheese-like goo and assorted goodness straight out of a can.","label":0},
	{"text":"Disgustingly amazing breakfast as usual. Order what you want and accept you are done for the day!","label":1},
	{"text":"Decent breakfast and great service. I found the much touted corned beef hash to be too salty but everything else we ordered was great. Overall, I recommend this restaurant for breakfast","label":1},
	{"text":"There are 2 types of \\\"\"Good\\\"\" restaurants in Pittsburgh. There is Yinzer good and Actually good. This food is Yinzer good. Way too much butter and sugar. Yuck.","label":0},
	{"text":"I had a salmon crepe here & it was delicious - broke me out of the habit of mostly eating dessert crepes. The only downside is that they only take cash... but there is an ATM just down the street. This is a great place to meet up with an old friend or acquaintance.","label":1},
	{"text":"I travel to Pittsburgh pretty often, and the owner who cooks the crepes recognizes my wife and me every single time we're there.\\n\\nThe crepes are excellent, the prices are more than reasonable, and as long as you don't go there during a peak period, it's never too crowded.","label":1},
	{"text":"Pompous manager hung up on me twice (!) when I called to ask about wait times.  Have never boycotted a restaurant until now.  Mediocre crepes don't entitle that sort of bush league behavior!","label":0},
	{"text":"The guy who works here gave me the best customer service and helped me pick out my new favorite jeans. Probably the best experience I have ever had at the Gap.","label":1},
	{"text":"Used him a long time ago and to this day I still feel ripped off. Swore up and down to me he could do a job and came up short. very short. Then had the nerve to blame me.\\n\\nNow he has the nerve to stay open.\\nHate this place!","label":0},
	{"text":"Went here after dinner to grab a frosty but gave up after an extended wait. The cashiers were busy chatting with their friends and couldn't be bothered to help anyone in line. The location also seemed a bit sketchy; I'd avoid this one. Try Panera Bread across the street.","label":0},
	{"text":"I will forever remember this drive-through conversation:\\n\\nWelcome to Wendy's. Can I take your order?\\n\\nYeah, I'd like a Frescuit. \\n\\nWe ain't got no hashbrowns!\\n\\n...um, all I want it a Frescuit. \\n\\nA'ight... I'm just lettin' you know.","label":0},
	{"text":"what is it with Wendys ?  They never get the orders right. If any of the employees would smile I would die from shock.  This review applies to many of the Wendys  that I have been to. Even in Florida.  Do they train them to be rude and ignorant ?","label":0},
	{"text":"Don't use the drive-thru. I'm not sure why I keep coming here (probably because the food is decent enough and cheap). Every time I'm here, without fail, I can expect to wait no less than 13 minutes in the drive-thru.","label":0},
	{"text":"Fast food.... NOT.\\n\\nBig corporate America places only get one shot w us. We came here cause we got stuff to do, quick trip to TARGET, try to get child fed quickly and to bed on time. SO LETS STOP AT Wendy's, right? Quick?\\n\\nSwing and miss. Never again.","label":0},
	{"text":"The portions are huge. Reasonable price. The fish I ordered was decent.","label":1},
	{"text":"General tso's chicken... was bad... just bad... too soy saucy... it needs more tanginess... It didn't taste the way that it should be... \\n\\nI am never going to order their General tso ever again. Never ever whatsoever!","label":0},
	{"text":"The worst chinese food I've had. I got the General Tso's Chicken and it came dry and very not spicy at all when I asked for extra spicy. Panda Express is better.","label":0},
	{"text":"Not very good Chinese food here. It reminded me of a cheap college place. They give you plenty of food but it is low quality. Could have probably went to another place and paid half the price for the same meal.","label":0},
	{"text":"So I wrote a review but it was filtered. I think people should know how awful this place is before stepping inside. I have no ties to this place; I don't know any of the other owners of shops in Shadyside and I am 100% un-bias and wrote my review purely on my experience there. Why was it filtered?","label":0},
	{"text":"The owner stole a bracelet brought in for repairs and has lied over and over about returning it.","label":0},
	{"text":"2 woman in the store were very helpful and knowledgable. I haven't received my piece yet and its been about 5 days. Iffy about who owns the place but, ill see what the end product will be once I was receive it. If it approves I will change my rating","label":0},
	{"text":"I didn't find the food all that flavorable, the service isn't great, and it's definitely not worth the price.","label":0},
	{"text":"We had Sunday brunch upstairs and I was very pleased with the quality and quantity of the dishes and the service. Lots better than most.","label":1},
	{"text":"Want good bloody mary's to kick off your Saturday or Sunday morning? Come to Walnut Grill. They throw a jumbo shrimp in it which is awesome. The eggs benedict is terrific!","label":1},
	{"text":"This place has cockroaches.\\nPeople throw up in the booths.\\nPretty good white russian.\\n\\n(b)","label":0},
	{"text":"I wasn't crazy about the Untouchable since I don't like Primanti's sandwiches, but the pizza was more than decent. Unfortunately, they don't deliver to us, so we had to go there to get it.","label":1},
	{"text":"New location in Rostraver! Great wings! Take out wings are usually soggy or\\nOver cooked...not these! Cajun and buffalo are Amazing!","label":1},
	{"text":"Nice people, and they never screw up my tailoring. Whenever I ask for an item to be done at a certain time they will get it done. Then I tell them I don't need it that fast and wait at least two weeks before picking it up. I wish the Taco Bell was still close by.","label":1},
	{"text":"Great family run restaurant . I have been going here for 20 years . the food is great and the owner who is the only waitress treats you like family .","label":1},
	{"text":"They do an okay job, but I find this place is VERY expensive and while they do an ok job, they don't do a great job.  You can find the same or better manicure near by, for half the price.","label":0},
	{"text":"Meh. This is not my kind of place. The food always seems oily or greasy and doesn't taste that good. Plus they have yellow fried rice. That is a big NO NO for me. It is kind of like mushed cardboard. I don't like it at all. I haven't eaten here in a while and i don't think i will start anytime soon.","label":0},
	{"text":"If you like waterlogged pasta, runny sauce and food that really is not that good, by all means eat here.  \\n\\nWater is cold, so that's a plus.","label":0},
	{"text":"Sad little place, even by Pittsburgh standards. Ambience of a funeral parlor, with average age of patrons about 69. Exemplary Calabria's dish? Oriental chicken salad garnished with uncooked ramen noodles.","label":0},
	{"text":"Very unhappy with the sales people did not do what they said they would do service department is very good","label":0},
	{"text":"I had both of my card spray painted and they worked with my insurance to fix both cars with no cost to me. It took a little longer than I would've liked but they did good work.","label":1},
	{"text":"The lady who runs the office is unpleasant and rude. Will not use this garage in the future.","label":0},
	{"text":"I personally believe that this is one of the nicer GE in the area. For some reason the inner-city ones seem dark and dingy. Also, I was at the Waterworks last month and they are renovating this to make it a Market District. If you don't know, now you know ;)","label":1},
	{"text":"I used to frequent Tai Pei once a week or so, but within the last few years, it has gone severely downhill. The food is greasy, way too expensive, and they use massive amounts of MSG. I got terrible MSG poisoning from Tai Pei and ever since then, have gone to Jimmy Wan's down the road.","label":0},
	{"text":"Consistently excellent.  I enjoy their sushi and know when I get a chicken dish I don't have to guess if it is eatable always good white meat.   I typically do take out and it is well worth the drive","label":1},
	{"text":"I pass this all of the time but finally decided to stop.  The restaurant is incredibly clean and it was great service, but I felt like the food was just \\\"\"okay.\\\"\"  Nothing to brag/boast about.  Prices are fair.  Maybe so many groupons because not enough people are raving about it?","label":0},
	{"text":"Excellent Chinese food.   Every time we have ordered take out from here, it's been great.  Egg Rolls, General Tso's, Happy Family, Triple Delight, dumplings...all taste delicious.","label":1},
	{"text":"I have only had takeout from Tai Pei, but the chicken lo mein was delicious and the general tso's was the best I have ever had! It was sweet, but still had a kick to it. Nothing was over priced and we weren't waiting forever for delivery. Will definitely visit the restaurant in the future!","label":1},
	{"text":"The food here is very good. I've frequented the restaurant many times for sushi, noodles, rice, and plenty of their other dishes. The atmosphere is also great and the service is very friendly. I would definitely recommend Taipei if you're craving Chinese and sushi.","label":1},
	{"text":"Food was very bland, i even asked that they kick it up a notch.  I traveled to this area from Northern Virginia.  I never had such bland Chinese food in all my travels.  I have had worse, the Scallops and Shrimp were fresh, the rice was cooked well.  Went here after my Brothers raved about it...","label":0},
	{"text":"We have a new puppy...  Chocolate lab.  So far he's had Parvo, giardia, worms, and probably stuff we don't even know!  He is very healthy now.  VCA was very accommodating, saw us quickly, and even helped us out a few times without charging (quick consults).  We highly recommend VCA","label":1},
	{"text":"Excellent espresso, with quick service.  Priced right too.  Parking can be a little tricky but worth the stop.","label":1},
	{"text":"Best place in town for all your keys/synths needs. Ask for Tony or anyone really , everyone is very helpful","label":1},
	{"text":"Best cigar selection in Pittsburgh. Their pipe tobacco blends are fantastic, I recommend RLP-6. Great atmosphere!","label":1},
	{"text":"As a non-smoker, it takes me a while to get used to the stink. As a karaoke lover, oh yea, it's the best place in the city! I would just come for great karaoke (my husband DJs every Thursday!) and a nice atmosphere.","label":1},
	{"text":"Big hotel. Not bad. Bathrooms way too small I had to dry off outside the bathroom. Priceline for good rate.","label":0},
	{"text":"My boyfriend enjoys brewing his own beer and the guys here are wonderful. They always have the supplies and if they don't they can recommend places to get them! Everyone is always very nice and knowledgeable!","label":1},
	{"text":"Worst wendy's I have ever been to in my travels all over the USA. Normally Wendy's is at the top of my fast food list. This particular location is HORRIBLE. AVOID !!!","label":0},
	{"text":"I have been to this location maybe 10 times in the past few years and every time I go through the drive through the order is wrong. No fries, no salad dressing with salad, no fork, and the last straw was at the bottom of my chili bowl it was about a 6in piece of paper. Avoid!!","label":0},
	{"text":"Good seafood and decent prices. If you want fancy food, this isn't the place for you. If you want alcohol with your meal go elsewhere as well. However, if you want good fish/shrimp at a good price served quickly and efficiently - this is your place. You can get fried, broiled or boiled (shrimp).","label":1},
	{"text":"The oysters and scallops where good but not $17 good.  This place is way over priced. If you come here be sure to check the prices before you order and ask if it's extra if you add scallops to to your meal.   Fired oysters and scallops over $17 here.  This will be the last time I come here.","label":0},
	{"text":"Had breakfast here one time and it was very primitive. Coffee was really bad.  I took one drink and trashed it.   Have been told they survive on the burgers.  Will have to try one and update but breakfast is a Not Recommend.","label":0},
	{"text":"Very good BBQ, and AMAZING onion rings!!!   We are headed there again tonight for our second trip in the past three weeks.","label":1},
	{"text":"Used to be my favorite pizza and sub shop but has really gone down hill the past year or so.  Many have mentioned how their recent visits have been dissapointing.","label":0},
	{"text":"food was okay but the place is filthy. Tables were dirty. Dead flies in window seals. Window blinds have food residue splattered on them.  Ceiling fans have dust caked on them. Gross...","label":0},
	{"text":"I have been eating here since I was a little girl, and it is always the same!  It is friendly, simple, and delicious!  The sub bread is so good and the crinkle fries are awesome too.  Don't expect fancy, but do expect a good lunch.","label":1},
	{"text":"I'm a big fan of mc d's but I was expecting more when I saw pork chop biscuit what a fail.","label":0},
	{"text":"Having people that don't speak English very well taking orders in the drive thru is a recipe for failure.  I always try to double check but feel rushed because of the amount of people behind me. My order is right 50% of the time.","label":0},
	{"text":"Worst McDonalds in the United States of America. I could get food faster in a prison cell. You have a better chance of the Pope going to hell than getting good service here.","label":0},
	{"text":"Here for trivia night on Tuesday night. Love me some Christina but they are way under staffed. It took almost an hour to get out food. Good food but this is ridiculous.  We had to go to the bar to order drinks. They need to get some help in here or people will stop coming!","label":0},
	{"text":"Best nail salon ever!! They always do a great job and the prices are very affordable. Everyone is always very nice and want to make sure that you are satisfed. I wouldn't go anywhere else.","label":1},
	{"text":"As a parent of a swimmer this is really not a great pool for watching a meet. The stands are small and the tiny results scoreboard is blocked by the crowd if not directly behind you. Parking is atrocious. The positive is the pool is pretty new and in good condition .","label":0},
	{"text":"I definitely learned alot about the south here. Really glad we spent a few hours here.  Makes you appreciate modern times.","label":1},
	{"text":"Very cool family trip not a lot of activities and the costumed employees acted  like we were actually bothering them. Never the less it was fun and my daughter liked it","label":1},
	{"text":"Excellent, full service dry cleaning & alterations  Have been using them for the past six years and have nothing but accolades for them.  If you live in the Stallings area, you should be using them.","label":1},
	{"text":"On multiple occasions they were not able to remove stains from the dresses, pants, etc but they charged me for the items. Not happy. I've decided that im not coming back to this place.","label":0},
	{"text":"This pizza is mediocre at best. Not really a NY style pizza - the crust is soggy, they finely chop the toppings - definitley not worth getting excited over.","label":0},
	{"text":"They do take out and delivery! The pizza is tastier than most delivery places. The 10\\\"\" is a good size for an individual pizza. The staff was a lot of fun to chat with and answered any questions we had. We will definitely be getting food from them again.","label":1},
	{"text":"Very good pizza!  This is usually our \\\"\"go to\\\"\" for pizza when the kids aren't around (they prefer Pizza hut) .  Pretty authentic NY Style pizza although a little bit on the pricey side.","label":1},
	{"text":"If you ever thought it was impossible to wait too long in the drive-thru, while you are the ONLY person there.....drop in on this hole in the wall.  It is possible!","label":0},
	{"text":"Either my English muffin sandwich sat under a hot lamp all morning OR Burger King's kitchen staff just decided to deep fry the whole damn thing.  If that's not enough, the sausage smelled of animal decay.\\n\\nJust awful.","label":0},
	{"text":"Todd is a great mechanic good person! His wife was so very nice I have told a lot of people about this place just because of his character! Thank you todd so very much as soon as I get my new hot rod its your to fix!","label":1},
	{"text":"Atmosphere aside, the food here was good. Particularly the general tso chicken. It was crispy not soggy like some places. It looks like your typical take out chinese joint so our expectations were not high to begin with but we enjoyed the food and would definitely go back.","label":1},
	{"text":"Staff made you feel as if they were doing you a favor by waiting on you. Owner on the phone and didn't even acknowledge the customer.  Food was awful. Will never go back","label":0},
	{"text":"Not recommended. Szechuan beef tasted like ketchup. Spring roll spongy and tasted bad. Pork fried rice is OK.  My daughter likes the Sesame Chicken but too sweet for my taste.","label":0},
	{"text":"It is too bad I can't give this zero stars.  Eat at your own risk!  I had Kung Pao Chicken and got really bad food poisoning.   The chicken was all dark meat and tasted aweful. I will never go back here again.","label":0},
	{"text":"Had their pizza last night for my sons sleepover. None of the kids ate it and complained that it tasted metallic. It was indeed pretty horrible even for $5.99 per medium. We will never go near the place again.","label":0},
	{"text":"Well for this being my first stay here with my family and pet. I must say the front desk crew and management are amazing.(Todd & Melissa) Very professional and friendly and helped make our stay a good one.","label":1},
	{"text":"So far, have only needed their services for bi-annual preventive maintenance/routine checkup but they have been very pleasant to work with.","label":1},
	{"text":"Great Mexican at a great price. Margaritas are awesome too. Servers are polite and service is quick. This is our go-to place for Mexican around the gaston county area.","label":1},
	{"text":"Salad bar was simple but delicious. The lotta burger was a must try! The salad bar also came with fresh pizza. Super nice staff and nostalgic feel made this a great treat after our mega jump!","label":1},
	{"text":"For japanese fast food, I love it. I can run in, order, head out pretty quick. The staff is friendly. If you want to eat the place has always been really clean. I just wished they deliveried!  :))","label":1},
	{"text":"Went there last night, great concept, good looking food ... Tasteless and bland.","label":0},
	{"text":"Staff are great - friendly and helpful. Beds are hit or miss. Some beds are noticeably  older and squeak horribly. Some are as comfy as could be. As usual, Sheraton pillows are amongst the best. Restaurant, bar, pool, and lobby are nice as well.","label":1},
	{"text":"This is my favorite Wing place, whether I go in person or have my food delivered. The owners are nice and so are those they have working with them. Even when they have forgotten something on my order during a delivery, they made sure to bring it back promptly. I think they are very accommodating.","label":1},
	{"text":"Ive been a customer for years and i went there today amd my chicken sandwhich i ordered it was completely frozen i took it back and they made me a new one with no sauce on it and it was completely dried out and over cooked. And the guy wanted to argue back. Im never going back.","label":0},
	{"text":"Delicious food (hook and ladder is my favorite). They are quick.  Plenty of space to eat inside or outside. \\nGREAT service!","label":1},
	{"text":"Clean, great staff good subs, even better that it right beside Starbucks. They also now take Apple Pay.","label":1},
	{"text":"Thank you everyone who posted reviews. Due to the information I have now researched, I will not be attending this store ever. I will be driving to another dicks location bc clearly this one seems to be one hot mess.","label":0},
	{"text":"Went for the buffet on Sunday.  As another reviewer said it was set up weird.  Grew up on German food and this didn't compare. Probably good for a restaurant though. Should try ordering from the menu it might be better.","label":0},
	{"text":"Fairly authentic german food. Great atmosphere. Liked it more before I actually went to Europe and had actual german food. Never going to be quite the same but I still love it! Good place to go for something different and tasty!","label":1},
	{"text":"AMAZING FOOD, AMAZING BEER!!!! I love this place!\\n\\nBest European Food in Charlotte, besides my mother's of course....","label":1},
	{"text":"If you enjoy German food, then this is the absolute BEST place in the area.  They have pretzel dough rolls that are just the bomb!  Lets also not forget to mention the copious amounts of awesome imported German beer!!","label":1},
	{"text":"Great food a staff that knows the food and menu. The Beer club is the best thign going in the area after a tueday at work. Close your eyes and open them quick and your in Germany. Beer selections for the real beer drinkers, go in and get a liter of some good germany brews.","label":1},
	{"text":"Absolutely five stars! Every time I come out this way to see family I make an attempt to stop in. The wait staff is always top notch, the bier is fantastic, the environment is friendly and pleasant; the food is spectacular. Thanks for a wonderful evening!","label":1},
	{"text":"This is one of my favorite restaurants in the area.  Pretzel rolls are served with a spicy mustard on the side that is to die for.  Food and service is always on point.  They have my Husbands favorite draft beer all year round- Oktoberfest.","label":1}
]
